{"headline": "I've Been Sick With COVID-19 For 3 Months. Here's What You Should Know.", "is_sarcastic": 0}
{"headline": "All I Want For My 90th Birthday Is To Abolish The Police And Build Our Dream World", "is_sarcastic": 0}
{"headline": "I Get It. You Want To Restart Your Life. But Doing So Could Kill My Child.", "is_sarcastic": 0}
{"headline": "I'm The Father Of A Newborn Baby Girl But I Won't Be A 'GirlDad.' Here's Why.", "is_sarcastic": 0}
{"headline": "Feds Set To Cut Coronavirus Testing Funds As COVID-19 Cases Soar", "is_sarcastic": 0}
{"headline": "Young Gay Liberal Leads Homophobic Preacher In Heated New York U.S. House Race", "is_sarcastic": 0}
{"headline": "Appeals Court Forces Dismissal Of Michael Flynn Case Over Judge's Objections", "is_sarcastic": 0}
{"headline": "Brendon Urie Shreds Trump For Using Panic! At The Disco Song At Arizona Rally", "is_sarcastic": 0}
{"headline": "Trump Notches His 200th Lifetime Federal Judge", "is_sarcastic": 0}
{"headline": "Georgia Bill Would Stop Officials From Mailing Absentee Ballot Applications", "is_sarcastic": 0}
{"headline": "I’ve Been In Prison For 24 Years. Now My Son Is Incarcerated Here, Too.", "is_sarcastic": 0}
{"headline": "My Dad Created An 'Ethical Will.' Here's What That Means And Why You May Want One Too.", "is_sarcastic": 0}
{"headline": "I Don’t Look Sick But I’ve Had MS For 14 Years. Here's How It's Changed My Life.", "is_sarcastic": 0}
{"headline": "A Video Of Johnniqua Charles Being Detained Went Viral. She Wants Cops To Learn From It.", "is_sarcastic": 0}
{"headline": "Introducing 'D Is For Desire,' HuffPost's New Love And Sex Podcast", "is_sarcastic": 0}
{"headline": "I Officiated A Zoom Funeral. Here’s What I Didn’t Expect.", "is_sarcastic": 0}
{"headline": "Here's What I Want My White Friends To Know About My Encounters With The Police", "is_sarcastic": 0}
{"headline": "I Lie To All My Health Care Providers About My Gender Identity", "is_sarcastic": 0}
{"headline": "As Day Cares Open Back Up, Here's What Parents Should Be Considering", "is_sarcastic": 0}
{"headline": "My 11-Year-Old Got Called The N-Word. White Parents, Talk To Your Kids About Racism.", "is_sarcastic": 0}
{"headline": "3 Questions White Students Should Ask Themselves Before Checking In On Black Classmates", "is_sarcastic": 0}
{"headline": "I've Decided To Come Out To The World As Genderfluid After Nearly Dying From COVID-19", "is_sarcastic": 0}
{"headline": "I'm A 73-Year-Old Black Woman. Here's How I've Kept Hope Alive For A Better Future.", "is_sarcastic": 0}
{"headline": "I Left My Conservative Hometown To Come Out. Now, I’m Back (With My Girlfriend).", "is_sarcastic": 0}
{"headline": "I'm A Black Woman With A White Man. These Weeks Have Been The Hardest Of Our Relationship.", "is_sarcastic": 0}
{"headline": "It's Time To Defund The Police And Start Funding Social Workers", "is_sarcastic": 0}
{"headline": "I'm A Trans Harry Potter Fan, And There Are A Few Things I Want J.K. Rowling To Know", "is_sarcastic": 0}
{"headline": "America Forced Me To Have 'The Talk' With My Black Child Before I Was Ready", "is_sarcastic": 0}
{"headline": "I'm A Therapist, And I'm Struggling With The COVID-19 Pandemic, Too", "is_sarcastic": 0}
{"headline": "Last Week, I Told My Black Son A Lie. I Hope He Never Discovers It's Untrue.", "is_sarcastic": 0}
{"headline": "This Is What I Want To Tell My White Professors When They Ask, 'How Are You Today?'", "is_sarcastic": 0}
{"headline": "To White Parents Who Want To Be Allies At This Time", "is_sarcastic": 0}
{"headline": "When My Child Came Out As Transgender, I Worried. Now I'm Witnessing Her Joy.", "is_sarcastic": 0}
{"headline": "I’m Immunocompromised. Marching For George Floyd Could Kill Me, But I’m Still Doing It.", "is_sarcastic": 0}
{"headline": "If We Want To Stop Police Brutality, Here Are The Immediate Steps Our Leaders Must Take", "is_sarcastic": 0}
{"headline": "White Women, I’m Glad You’re Showing Up. But I’m Not Sure I Trust You Just Yet.", "is_sarcastic": 0}
{"headline": "I'm Black. My Mom Is White. This Is The Talk We Had To Have About George Floyd's Murder.", "is_sarcastic": 0}
{"headline": "COVID-19 Has Devastated The Black Community. Here's Why And What Needs To Change.", "is_sarcastic": 0}
{"headline": "I'm Due To Give Birth Today But All I Can Think About Is George Floyd", "is_sarcastic": 0}
{"headline": "I'm An Angry Black Woman. This Is What I Want White People To Know.", "is_sarcastic": 0}
{"headline": "I'm A COVID-19 Doctor. Do You Know What I'd Like To See From Our President? Compassion.", "is_sarcastic": 0}
{"headline": "My Half Siblings Found Me On 23andMe. I Wasn't Prepared For What Happened Next.", "is_sarcastic": 0}
{"headline": "Women Are Sharing Candid Photos To Send A Message To Pandemic Body-Shamers", "is_sarcastic": 0}
{"headline": "I Had To Decide Whether To Recommend My Rapist Be Paroled During The Pandemic", "is_sarcastic": 0}
{"headline": "I Traveled To Texas During The Pandemic To Provide Abortion Care. Here's What I Saw.", "is_sarcastic": 0}
{"headline": "I'm An Adult Who Is Constantly Mistaken For A 12-Year-Old. This Is What My Life Is Like.", "is_sarcastic": 0}
{"headline": "I Love My White Boyfriend But There’s One Thing He Can Never Understand", "is_sarcastic": 0}
{"headline": "I Belong In This Country, But The Census Doesn't Recognize That", "is_sarcastic": 0}
{"headline": "After Giving Birth, I Had Violent Thoughts About Hurting My Baby. Now I Know Why.", "is_sarcastic": 0}
{"headline": "After 7 1/2 Months Sober, I Relapsed During Quarantine. Here's What Happened.", "is_sarcastic": 0}
{"headline": "I Was Set To Become An Elite Athlete This Year. Instead I Got A Job At A Grocery Store.", "is_sarcastic": 0}
{"headline": "I Fell In Love With My Landlady's Son. Now We're All In Lockdown Together.", "is_sarcastic": 0}
{"headline": "I’m A Tarot Card Reader. Here’s What People Want Most From Me During The Pandemic.", "is_sarcastic": 0}
{"headline": "My Son Lost His Birthday Party To COVID-19. What Happened Next Blew Me Away.", "is_sarcastic": 0}
{"headline": "I'm A Doctor, And I'm Losing Patients To A Deadly Side Effect Of The Pandemic", "is_sarcastic": 0}
{"headline": "Rebecca Black Told Us To 'Get Down' On Friday. But How Do We Do It During A Pandemic?", "is_sarcastic": 0}
{"headline": "I Spent 10 Years Building My Small Business. COVID-19 Destroyed It In Just 8 Weeks.", "is_sarcastic": 0}
{"headline": "To Celebrities Who Say Teachers Should Make Millions: Put Your Money Where Your Mouth Is", "is_sarcastic": 0}
{"headline": "I'm An AIDS Survivor And COVID-19 Is Giving Me Flashbacks", "is_sarcastic": 0}
{"headline": "Zoom And FaceTime Are The New Normal, But They're Literally Making Me Sick", "is_sarcastic": 0}
{"headline": "I Feel Like I’m Failing At Motherhood In Quarantine", "is_sarcastic": 0}
{"headline": "I Started My Period At Age 10. My Mom Made It The Best Day Ever.", "is_sarcastic": 0}
{"headline": "I Study Human Touch. I'm Questioning What Our Future Will Be Like After COVID-19.", "is_sarcastic": 0}
{"headline": "My Sweet, Beautiful Daughter Just Died, And I Don't Know How I'm Supposed To Grieve", "is_sarcastic": 0}
{"headline": "Every Time A Celebrity Loses Weight I'm Reminded Of How Messed Up My Body Image Is", "is_sarcastic": 0}
{"headline": "I'm One Of The Resident Doctors In NYC. Here's How We're Being Exploited.", "is_sarcastic": 0}
{"headline": "I'm Bisexual. I Used Coming Out As An April Fools' Joke — And I Want To Apologize.", "is_sarcastic": 0}
{"headline": "Drive-Thru Strip Club Serves Up Sexy (And Safe) Solution For Coronavirus Blues", "is_sarcastic": 0}
{"headline": "Social Distancing Feels A Lot Like My Immigrant Childhood. Here's How.", "is_sarcastic": 0}
{"headline": "I'm A Doctor In A COVID-19 Unit. Before You Call Me A Hero, Here's What You Should Know.", "is_sarcastic": 0}
{"headline": "My Beloved Dog Just Died. I Don’t Know How To Grieve Without Feeling Guilty.", "is_sarcastic": 0}
{"headline": "I Studied The 2014 Ebola Outbreak. Here's The Lesson We Didn't Learn.", "is_sarcastic": 0}
{"headline": "My Roommate And I Made An App To Help Essential Workers Desperate For Supplies", "is_sarcastic": 0}
{"headline": "Once The Pandemic Is Over, Can We Keep The World This Accessible?", "is_sarcastic": 0}
{"headline": "GEORGE CONWAY", "is_sarcastic": 0}
{"headline": "U.S. NEWS", "is_sarcastic": 0}
{"headline": "DONALD TRUMP", "is_sarcastic": 0}
{"headline": "KAMALA HARRIS", "is_sarcastic": 0}
{"headline": "CNN", "is_sarcastic": 0}
{"headline": "Feds Set To Cut Coronavirus Testing Funds As COVID-19 Cases Soar", "is_sarcastic": 0}
{"headline": "Young Gay Liberal Leads Homophobic Preacher In Heated New York U.S. House Race", "is_sarcastic": 0}
{"headline": "Appeals Court Forces Dismissal Of Michael Flynn Case Over Judge's Objections", "is_sarcastic": 0}
{"headline": "Brendon Urie Shreds Trump For Using Panic! At The Disco Song At Arizona Rally", "is_sarcastic": 0}
{"headline": "Nick Cordero's Wife Sees Him For First Time Since Coronavirus Hospitalization", "is_sarcastic": 0}
{"headline": "Jessi Combs Officially Recognized By Guinness As The Fastest Woman On Earth", "is_sarcastic": 0}
{"headline": "Jennifer Aniston Jokes About 'Friends' Frustration: 'Stop Playing That F**king Show'", "is_sarcastic": 0}
{"headline": "Here's A Montage Of Trump Saying Dumb Stuff, Then Saying He Was Joking", "is_sarcastic": 0}
{"headline": "Mitch McConnell Is A Spineless Garden Pest In Jim Carrey’s Latest Artwork", "is_sarcastic": 0}
{"headline": "Trump Notches His 200th Lifetime Federal Judge", "is_sarcastic": 0}
{"headline": "Georgia Bill Would Stop Officials From Mailing Absentee Ballot Applications", "is_sarcastic": 0}
{"headline": "Daily Coronavirus Cases Once Again At Peak As Lockdown Measures Lift", "is_sarcastic": 0}
{"headline": "Democratic National Convention Will Be Almost Entirely Virtual", "is_sarcastic": 0}
{"headline": "Police Reform Stalls Out In The Senate", "is_sarcastic": 0}
{"headline": "Mississippi Attorney General Supports Changing State's Confederate-Themed Flag", "is_sarcastic": 0}
{"headline": "DOJ Whistleblowers Testify That William Barr Has Politicized Justice", "is_sarcastic": 0}
{"headline": "Kentucky’s Election Wasn’t A Disaster, But It Exposed Problems In Pandemic-Era Voting", "is_sarcastic": 0}
{"headline": "Minnesota Sues Exxon, Koch And API For Being 'Deceptive' On Climate Change", "is_sarcastic": 0}
{"headline": "Donald Trump Jr. Desperately Tries To Spin His Dad's 'Walk Of Shame' Picture", "is_sarcastic": 0}
{"headline": "USCIS Prepares For Massive Staff Cuts In Blow To Legal Immigration System", "is_sarcastic": 0}
{"headline": "'Mass Murder': Trump's Coronavirus Confession Is Already Being Used In Attack Ads", "is_sarcastic": 0}
{"headline": "Anti-Mask Floridians Hurl Conspiracy Theories At Officials In Wild Public Meeting", "is_sarcastic": 0}
{"headline": "Trump's Bizarre COVID-19 Question Gets Plenty Of Answers On Twitter", "is_sarcastic": 0}
{"headline": "Rhode Island Takes Step Toward Removing 'Plantation' From Official Name", "is_sarcastic": 0}
{"headline": "Madison Cawthorn, 24, Defeats Trump's Pick In North Carolina GOP Congressional Primary", "is_sarcastic": 0}
{"headline": "Anderson Cooper Blasts ‘Biological Bunker’ Dweller Trump Over Coronavirus Hypocrisy", "is_sarcastic": 0}
{"headline": "Detroit Man Demands Police Department Abandon Face Recognition Technology", "is_sarcastic": 0}
{"headline": "Ex-Trump Aide Gorka Boasts About Not Wearing 'COVID Burqas' To Combat Coronavirus", "is_sarcastic": 0}
{"headline": "Rachel Maddow Spells Out The Danger That Trump’s Rallies Pose To The World", "is_sarcastic": 0}
{"headline": "Obama Explains Why Democrats Can’t Afford To Get Smug About Trump", "is_sarcastic": 0}
{"headline": "Jamaal Bowman Ahead With Results Too Close To Call In Key New York House Race", "is_sarcastic": 0}
{"headline": "Georgia Lawmakers Pass Hate Crimes Legislation, More Police Protections", "is_sarcastic": 0}
{"headline": "Trump Family Moves To Block Tell-All Written By President’s Niece", "is_sarcastic": 0}
{"headline": "Trump Spends Rally Downplaying Coronavirus And Making Racist Jokes", "is_sarcastic": 0}
{"headline": "Dr. Cameron Webb Wins Democratic Nomination For U.S. House In Virginia", "is_sarcastic": 0}
{"headline": "4 Years Later, Only 3 New Miles of 'Wall' And Not A Single Peso From Mexico", "is_sarcastic": 0}
{"headline": "Noose Found In Garage Used By NASCAR’s Bubba Wallace Was There In 2019: FBI", "is_sarcastic": 0}
{"headline": "Donald Trump Is Using The Pandemic To Push His Anti-Immigration Agenda", "is_sarcastic": 0}
{"headline": "Republicans Think The U.S. Should Speed Up -- Not Slow Down -- Coronavirus Testing", "is_sarcastic": 0}
{"headline": "Roger Stone Prosecutor Says DOJ Leaders Applied ‘Heavy Pressure' To Cut Him A Break", "is_sarcastic": 0}
{"headline": "Trump Says He Wasn't Joking About Slowing COVID-19 Testing: 'I Don't Kid'", "is_sarcastic": 0}
{"headline": "Giuliani Says Black Lives Matter Wants To ‘Take Your House Away From You’", "is_sarcastic": 0}
{"headline": "The R-Rated Art Campaign That’s A 2-Word 'Primal Scream’ Against Trump", "is_sarcastic": 0}
{"headline": "Chuck Schumer Faces The Progressive Surge", "is_sarcastic": 0}
{"headline": "Democrats Threaten To Block 'Woefully Inadequate' GOP Police Reform Bill", "is_sarcastic": 0}
{"headline": "Kentucky And New York Hold Primaries Amid Concerns About Polling Site Closures", "is_sarcastic": 0}
{"headline": "Donald Trump Makes 'Hustory' With Latest Weird Twitter Typo", "is_sarcastic": 0}
{"headline": "Fauci To Testify At A Fraught Time For U.S. Coronavirus Pandemic Response", "is_sarcastic": 0}
{"headline": "Trump Says He's Issuing An Edict To 'Make Cities Guard Their Monuments'", "is_sarcastic": 0}
{"headline": "Police Pepper-Spray Protesters Trying To Pull Down Andrew Jackson Statue In DC", "is_sarcastic": 0}
{"headline": "Confederate Flag-Waving Trump Supporter Praises KKK, Vows To Teach Hate", "is_sarcastic": 0}
{"headline": "The South Has Some Of The Nation’s Dirtiest Electricity. Now It’s Seeing A Coronavirus Uptick.", "is_sarcastic": 0}
{"headline": "MSNBC Supercut Exposes Trump’s Go-To Defense Of His Outrageous Statements", "is_sarcastic": 0}
{"headline": "Even Lou Dobbs Admits Trump's Rally In Tulsa Was 'A Mess'", "is_sarcastic": 0}
{"headline": "Republican Group Relentlessly Dunks On 'Disheveled' Post-Rally Trump In New Ad", "is_sarcastic": 0}
{"headline": "TikTok Comedian Knocks It Out Of The Arena Over Trump's 'Amazing' Fake Numbers", "is_sarcastic": 0}
{"headline": "Biden Campaign Commits To 3 General Election Debates", "is_sarcastic": 0}
{"headline": "Trump Baselessly Accuses Obama Of ‘Treason’", "is_sarcastic": 0}
{"headline": "Watchdog Launches Probe Of Police Attacks On Protesters Before Trump Posed With Bible", "is_sarcastic": 0}
{"headline": "Schools Across U.S. Wonder How To Social Distance With Meager Budgets", "is_sarcastic": 0}
{"headline": "The Fed’s Coronavirus Spending On Fossil Fuel Could Dig A $19 Billion Money Pit", "is_sarcastic": 0}
{"headline": "Firing Of U.S. Attorney Highlights William Barr’s Pattern Of Misleading The Public", "is_sarcastic": 0}
{"headline": "Brexit Leader Allowed To Attend Trump Rally With A ‘National Interest’ Travel Ban Waiver", "is_sarcastic": 0}
{"headline": "Mike Pence Reportedly Voted Via 'Rigged' Mail System, Joining Other Officials (And Trump)", "is_sarcastic": 0}
{"headline": "Trump Expands Immigration Ban To Suspend Foreign Worker Visas", "is_sarcastic": 0}
{"headline": "How The Black Lives Matter Protests Are Shaking Up New York’s Primaries", "is_sarcastic": 0}
{"headline": "Neo-Nazi U.S. Soldier Faces Federal Terrorism Charges For Plotting Attack On Unit", "is_sarcastic": 0}
{"headline": "2 Lawyers Of Color Face 45-Year Sentences — For Vandalism", "is_sarcastic": 0}
{"headline": "Why Health Care Workers Don’t Have Paid Sick Days During The Pandemic", "is_sarcastic": 0}
{"headline": "Trump Sitting On Funds Meant To Boost Coronavirus Testing, Top Democrats Say", "is_sarcastic": 0}
{"headline": "Trump Won't Say If He Really Asked For Coronavirus Testing To Slow Down", "is_sarcastic": 0}
{"headline": "Trump Baselessly Claims 2020 Election Is 'RIGGED' Months Before Any Votes Are Cast", "is_sarcastic": 0}
{"headline": "Size Matters: Never-Trump GOP Group Dumps On President's Puny Rally In New Attack Ad", "is_sarcastic": 0}
{"headline": "Tulsa Rally Failure May Spark Trump Campaign Team Shakeup", "is_sarcastic": 0}
{"headline": "'Walk Of Shame': Deflated Trump's Lonely Helicopter Walk Becomes Biting New Meme", "is_sarcastic": 0}
{"headline": "Michelle Obama Shares Sweet Family Throwback Photo For Father's Day", "is_sarcastic": 0}
{"headline": "Noose Found In Garage Used By NASCAR’s Bubba Wallace", "is_sarcastic": 0}
{"headline": "Tom Petty's Family Demands Trump Stop Using 'I Won't Back Down' In 'Campaign Of Hate'", "is_sarcastic": 0}
{"headline": "TikTok Users, K-Pop Fans Say They Sabotaged Trump Rally By Inflating Registrations", "is_sarcastic": 0}
{"headline": "Homeland Security Secretary: Trump's Threats To 'Bomb' Bolton Were A Joke", "is_sarcastic": 0}
{"headline": "Zoomers Boast They Sabotaged Trump Rally Turnout With Fake Reservations", "is_sarcastic": 0}
{"headline": "House Judiciary Chairman: Calls For Barr's Impeachment Are 'Waste Of Time'", "is_sarcastic": 0}
{"headline": "Investing In Harm Reduction Must Be Included In The Movement To Defund Police", "is_sarcastic": 0}
{"headline": "Millions Are Unemployed. Crises Abound. Is It Time To Guarantee Public Service Jobs?", "is_sarcastic": 0}
{"headline": "Trump Uses Racist Terms 'Kung Flu' And 'Chinese Virus' To Describe COVID-19", "is_sarcastic": 0}
{"headline": "After Weeks Of Anticipation, Trump Rally Crowd Underwhelms", "is_sarcastic": 0}
{"headline": "Trump Camp Lashes Media, 'Radical Protesters' For Lackluster Rally Turnout", "is_sarcastic": 0}
{"headline": "Twin Trump 'Bunker Baby' Balloons Make The Scene Ahead Of Tulsa Rally", "is_sarcastic": 0}
{"headline": "Trump Fires U.S. Attorney Who Led Probes Of The President's Men", "is_sarcastic": 0}
{"headline": "Police Arrest Peaceful Protester Sitting Alone By Trump Rally Venue", "is_sarcastic": 0}
{"headline": "Joe Biden Raised More Money Than Donald Trump For The First Time", "is_sarcastic": 0}
{"headline": "Florida Governor Ripped For Trying To Pin COVID-19 Spike On Hispanic Workers", "is_sarcastic": 0}
{"headline": "Judge Rejects White House Request To Block John Bolton's New Book", "is_sarcastic": 0}
{"headline": "The Coronavirus Pandemic Doesn't Care That We're All Bored With It", "is_sarcastic": 0}
{"headline": "3 Congressional Races To Watch In New York's Democratic Primary", "is_sarcastic": 0}
{"headline": "Mick Mulvaney Spectacularly Self-Owns With His 'One Criticism' Of Donald Trump", "is_sarcastic": 0}
{"headline": "Tulsa Health Official Has A Stark Wake-Up Call For People Attending Trump Rally", "is_sarcastic": 0}
{"headline": "What Reforming Police Unions Might Look Like", "is_sarcastic": 0}
{"headline": "Susan Rice Explains Exactly Why Trump's White House Is 'Racist To Its Core'", "is_sarcastic": 0}
{"headline": "Scathing Supercut Shows How Quickly Trump Flips On His Once Most Trusted Aides", "is_sarcastic": 0}
{"headline": "Robert E. Lee Statue Sleeps With The Fishes In Jim Carrey’s New Cartoon", "is_sarcastic": 0}
{"headline": "Fox News' John Roberts Uses War Analogy To Describe Preparing For Trump Rally In Pandemic", "is_sarcastic": 0}
{"headline": "Trump's 'Racist' Toddler Video Removed By Facebook,Twitter After Parent Complains", "is_sarcastic": 0}
{"headline": "Trump Compared To Segregationist George Wallace In Scathing Republican Ad", "is_sarcastic": 0}
{"headline": "William Barr Says U.S. Attorney In Manhattan Is Resigning. U.S. Attorney Says No, He's Not.", "is_sarcastic": 0}
{"headline": "Pressed Repeatedly To Say ‘Black Lives Matter,’ Mike Pence Says ‘All Lives Matter’", "is_sarcastic": 0}
{"headline": "US Attorney Who Oversaw Cases Of Trump Allies Steps Down", "is_sarcastic": 0}
{"headline": "Twitter Users Give Trump's Tulsa Rally Another Name: 'Coronapalooza'", "is_sarcastic": 0}
{"headline": "GOP Candidate Says Black Democratic Opponent Is 'NOT For ALL Virginians'", "is_sarcastic": 0}
{"headline": "Melania Trump Posts Juneteenth Tweet And Gets Reminded Of 'Birther' Past", "is_sarcastic": 0}
{"headline": "Anthony Fauci Warned White House That Tulsa Rally Would Be Dangerous: Report", "is_sarcastic": 0}
{"headline": "Trump Sets The Stage For Mayhem At Tulsa Rally", "is_sarcastic": 0}
{"headline": "The Real Looters Of The Bronx", "is_sarcastic": 0}
{"headline": "Court Says Trump Rally Attendees Don't Have To Wear Masks", "is_sarcastic": 0}
{"headline": "Coloradans Are Getting Mysterious Texts Bashing Democratic Senate Candidate John Hickenlooper", "is_sarcastic": 0}
{"headline": "TSA Worsened Coronavirus Pandemic, Whistleblower Says", "is_sarcastic": 0}
{"headline": "More Lawmakers, Including Republicans, Support A Juneteenth National Holiday", "is_sarcastic": 0}
{"headline": "Donald Trump Vows To Keep Trying To End Dreamer Protections", "is_sarcastic": 0}
{"headline": "Trump Threatens Protesters On Juneteenth", "is_sarcastic": 0}
{"headline": "Charles Booker Suddenly Has Progressives Excited About Kentucky", "is_sarcastic": 0}
{"headline": "Conservative Columnist Underscores The Magnitude Of What Bolton’s Book Reveals", "is_sarcastic": 0}
{"headline": "Arnold Schwarzenegger Goes Full Terminator On People Politicizing Face Masks", "is_sarcastic": 0}
{"headline": "Twitter Users Take Eric Trump To The Woodshed For Lame Swipe At Biden", "is_sarcastic": 0}
{"headline": "Oklahoma Republicans Speak Out Against Trump Ahead Of Tulsa Rally", "is_sarcastic": 0}
{"headline": "Tennessee Lawmakers Advance 6-Week Abortion Ban In Overnight Vote", "is_sarcastic": 0}
{"headline": "Fauci Warns Of Troubling ‘Anti-Science’ Beliefs As Nation Battles Coronavirus", "is_sarcastic": 0}
{"headline": "Klobuchar Withdraws From VP Search, Says Biden Should Select Woman of Color", "is_sarcastic": 0}
{"headline": "Senior State Department Official Resigns Over Trump’s Response To Racial Injustice", "is_sarcastic": 0}
{"headline": "CBS Reporter Paula Reid Asks Trump Question All Journalists Should Ask", "is_sarcastic": 0}
{"headline": "Americans Are Losing Faith In What The Government Says About Coronavirus", "is_sarcastic": 0}
{"headline": "Florida Sees Record Number Of Coronavirus Cases As Experts Eye Possible New Epicenter", "is_sarcastic": 0}
{"headline": "California Issues New, Stricter Statewide Mask Requirement", "is_sarcastic": 0}
{"headline": "‘We’re Here To Stay’: Dreamers Celebrate DACA Ruling", "is_sarcastic": 0}
{"headline": "Lin-Manuel Miranda Burns John Bolton For Using 'Hamilton' Song As Book Title", "is_sarcastic": 0}
{"headline": "Senate Confirms Mitch McConnell's 38-Year-Old Protege To Powerful Court Seat", "is_sarcastic": 0}
{"headline": "Facebook Takes Down Trump Campaign Ads Featuring Nazi Iconography", "is_sarcastic": 0}
{"headline": "Trump Begging Xi For Election Help May Crimp His Efforts To Paint Biden As Soft On China", "is_sarcastic": 0}
{"headline": "Republicans Dismiss Bombshell John Bolton Allegations Against Trump", "is_sarcastic": 0}
{"headline": "The Trump Administration Has Left Workplace Safety Up To Your Boss", "is_sarcastic": 0}
{"headline": "Twitter Users Pile On Trump After He Asks If Supreme Court Dislikes Him", "is_sarcastic": 0}
{"headline": "Trump Takes Credit For 'Making Juneteenth Famous' In Dumbfounding Interview", "is_sarcastic": 0}
{"headline": "Nancy Pelosi Removes Portraits Of Confederate House Speakers From U.S. Capitol", "is_sarcastic": 0}
{"headline": "GOP Sheriff Who Refused To Enforce Coronavirus Lockdown Tests Positive At White House", "is_sarcastic": 0}
{"headline": "Supreme Court Rules Trump Wrongly Ended DACA, Leaves Program In Place", "is_sarcastic": 0}
{"headline": "Democrats Call For Permanent Protection Of Dreamers After Supreme Court’s DACA Ruling", "is_sarcastic": 0}
{"headline": "Trump Rips Supreme Court Ruling That Saves DACA: 'Shotgun Blasts Into The Face'", "is_sarcastic": 0}
{"headline": "Why Biden Is Trouncing Trump With Young Voters: ‘Old Is Way, Way Better Than Liar’", "is_sarcastic": 0}
{"headline": "Trump's Midnight Twitter Rant Against Bolton Backfires Spectacularly", "is_sarcastic": 0}
{"headline": "John Bolton: Trump Not Fit For Office, Putin Thinks He Can 'Play Him Like A Fiddle'", "is_sarcastic": 0}
{"headline": "'Disturbing’ Ivanka Trump Emails Resurface In Wake Of Bolton Book", "is_sarcastic": 0}
{"headline": "Jennifer McClellan Could Make History As Virginia's First Black Female Governor", "is_sarcastic": 0}
{"headline": "Tucker Carlson’s Racist Rhetoric Laid Bare With The Help Of Some... Rabbits", "is_sarcastic": 0}
{"headline": "Rep. Cedric Richmond Calls Out Matt Gaetz In Fiery Exchange: 'Was That A Nerve?'", "is_sarcastic": 0}
{"headline": "Trump Says Police Killing Of Rayshard Brooks ‘Terrible,’ But ‘You Can’t Resist’ Officers", "is_sarcastic": 0}
{"headline": "Trump Excoriates John Bolton Ahead Of Book Release: 'He Is A Liar'", "is_sarcastic": 0}
{"headline": "Justice Department Seeks Restraining Order Against John Bolton Over New Book", "is_sarcastic": 0}
{"headline": "Israel Hawks Are Scrambling To Save Democratic Rep. Eliot Engel", "is_sarcastic": 0}
{"headline": "‘That 70s Show’ Actor Danny Masterson Charged With Raping 3 Women", "is_sarcastic": 0}
{"headline": "Bolton Claims Trump Encouraged Xi To Build 'Concentration Camps' For Uighurs", "is_sarcastic": 0}
{"headline": "Welcome To The Mask Wars", "is_sarcastic": 0}
{"headline": "Bolton Claims Trump Asked China's President For Favor To Boost Reelection Chances", "is_sarcastic": 0}
{"headline": "Senate Passes Major Public Lands Bill", "is_sarcastic": 0}
{"headline": "Mississippi Official: Black People 'Dependent' Since Slavery", "is_sarcastic": 0}
{"headline": "The Police Aren't Very Good At Their Main Job: Solving Crimes", "is_sarcastic": 0}
{"headline": "GOP Cowardice On Trump Takes Center Stage In Scathing New Supercut", "is_sarcastic": 0}
{"headline": "Carol Barr, Wife Of GOP Rep. Andy Barr, Dies Suddenly At Age 39", "is_sarcastic": 0}
{"headline": "Anthony Fauci Hasn’t Talked With Trump About Coronavirus In 2 Weeks", "is_sarcastic": 0}
{"headline": "Book By Trump’s Niece To Reveal He ‘Derided’ Father’s Alzheimer’s Struggles", "is_sarcastic": 0}
{"headline": "'As Pathetic As It Is Reckless': Mike Pence Hammered Over Coronavirus Op-Ed", "is_sarcastic": 0}
{"headline": "Ingraham Shows She’s Either Oblivious To Trump's Racism — Or Is Gaslighting You", "is_sarcastic": 0}
{"headline": "Judge Orders Trump Administration To Give Tribes Their COVID-19 Relief Funds", "is_sarcastic": 0}
{"headline": "Republican Group Questions Trump’s Health: ‘It’s Time We Talk About This’", "is_sarcastic": 0}
{"headline": "3 States See Record High In Daily Coronavirus Infections After Reopening", "is_sarcastic": 0}
{"headline": "New Mexico Shooting Raises Specter Of Right-Wing Violence Around Statue Protests", "is_sarcastic": 0}
{"headline": "Mississippi Set To Become The 13th State To Criminalize Fossil Fuel Protests", "is_sarcastic": 0}
{"headline": "Virginia Democrats Could Elect The First Black Physician To Congress", "is_sarcastic": 0}
{"headline": "Far-Right 'Boogaloo' Supporter Charged With Murder In Deaths Of Officers", "is_sarcastic": 0}
{"headline": "Pence Says All 50 States Reopening In 'Responsible Manner.' Fauci Says Otherwise.", "is_sarcastic": 0}
{"headline": "Ilhan Omar Isn't Done Fighting", "is_sarcastic": 0}
{"headline": "Trump Claims COVID-19 Will Go Away And That An AIDS Vaccine Exists. It Doesn’t.", "is_sarcastic": 0}
{"headline": "Congress Could Make Juneteenth A National Holiday", "is_sarcastic": 0}
{"headline": "Trump Says He Gave Out 1 Million Tickets To His Tulsa Rally. That Means 980,801 Fans Won't Fit.", "is_sarcastic": 0}
{"headline": "Ex-Trump Aide Sebastian Gorka May Get Role Atop Voice Of America: Report", "is_sarcastic": 0}
{"headline": "‘So True!’ Trump Mocked For Retweeting Himself, Then Agreeing With Himself", "is_sarcastic": 0}
{"headline": "Laura Ingraham Calls Fauci ‘Medical Deep State,’ Tells Trump To Ignore Rally Virus Warnings", "is_sarcastic": 0}
{"headline": "Dr. Sanjay Gupta: Trump Rally Is ‘Worst-Case Scenario’ For Spreading Coronavirus", "is_sarcastic": 0}
{"headline": "Pence Tells Governors To Share Misleading Facts About Coronavirus Infections: Reports", "is_sarcastic": 0}
{"headline": "Tucker Carlson Dials Up Fear Factor In Ugly New Attack On Black Lives Matter", "is_sarcastic": 0}
{"headline": "Fox News Presses Larry Kudlow On COVID-19 Spikes After He Declared No Second Wave", "is_sarcastic": 0}
{"headline": "Rep. Ilhan Omar’s Father Dies From Complications Of COVID-19", "is_sarcastic": 0}
{"headline": "Pence Says Oklahoma COVID-19 Cases Have 'Flattened' — 2 Days After Record Jump", "is_sarcastic": 0}
{"headline": "NYPD To Reassign 600 ‘Anti-Crime’ Plainclothes Officers Amid Protests", "is_sarcastic": 0}
{"headline": "Tennessee Must Allow Vote By Mail For All Amid Coronavirus Pandemic, Judge Rules", "is_sarcastic": 0}
{"headline": "California Vows To Take Steps To Protect Protesters From Police Abuse", "is_sarcastic": 0}
{"headline": "Senate Democrats Kneel In Protest Of Racial Injustice", "is_sarcastic": 0}
{"headline": "New Jobs Report Diminishes GOP Appetite For More Virus Aid", "is_sarcastic": 0}
{"headline": "NYPD Uses Aggressive Tactics On Peaceful Demonstrators Out After Curfew", "is_sarcastic": 0}
{"headline": "Yosemite National Park To Reopen This Week", "is_sarcastic": 0}
{"headline": "Rev. Al Sharpton Slams Trump: 'We Cannot Use Bibles As A Prop'", "is_sarcastic": 0}
{"headline": "Push To Reform U.S. Police Intensifies Ahead Of George Floyd Funeral", "is_sarcastic": 0}
{"headline": "Trump Orders Withdrawal Of National Guard In D.C. As Anti-Racism Protests Continue", "is_sarcastic": 0}
{"headline": "COVID-19's Economic Fallout Is Hitting The Black Community Hard, Too", "is_sarcastic": 0}
{"headline": "The Fight To Fix Policing Starts At The City Council", "is_sarcastic": 0}
{"headline": "'We Have No Choice': Minneapolis City Council President Wants To 'Dismantle' The Police", "is_sarcastic": 0}
{"headline": "Trump Cheers Tom Cotton After Times Editor’s Exit Over Op-Ed", "is_sarcastic": 0}
{"headline": "IBM To End Facial Recognition Business And Oppose Use For Surveillance By Police", "is_sarcastic": 0}
{"headline": "White House Forces Press To Breach Social Distancing Guidelines Because It 'Looks Better'", "is_sarcastic": 0}
{"headline": "Drew Brees Stands Against Trump: Racial Justice Protests 'Not About The American Flag'", "is_sarcastic": 0}
{"headline": "DC Mayor Has 'Black Lives Matter' Painted On Street Leading To White House", "is_sarcastic": 0}
{"headline": "Mitt Romney Joins Black Lives Matter Protesters Marching Toward White House", "is_sarcastic": 0}
{"headline": "Marine Corps Bans Confederate Flag From Public Display", "is_sarcastic": 0}
{"headline": "'Live PD' Dropped By A&E On Heels Of 'Cops' Cancellation", "is_sarcastic": 0}
{"headline": "California Mayor Resigns After Email About Police Brutality Sparks Outrage", "is_sarcastic": 0}
{"headline": "Trump Administration Proposes Sweeping Asylum Restrictions", "is_sarcastic": 0}
{"headline": "Pentagon Threat Sparked Shocking Crackdown On Protesters For Trump Photo Op: Report", "is_sarcastic": 0}
{"headline": "For Black Women, There's Nothing To Celebrate In The Unemployment Numbers", "is_sarcastic": 0}
{"headline": "Watchdog Calls For FBI Probe Into Medical And Pharma Stock Holdings Of Pence Chief Of Staff", "is_sarcastic": 0}
{"headline": "Zuckerberg Says He'll Review Policies That Allowed Trump's Inflammatory Post", "is_sarcastic": 0}
{"headline": "New York City Curfew Lifts Early Following Peaceful Protests", "is_sarcastic": 0}
{"headline": "Biden Formally Secures Democratic Presidential Nomination", "is_sarcastic": 0}
{"headline": "California Gov. Newsom Likes To ‘Go Big’ But Doesn’t Always Deliver", "is_sarcastic": 0}
{"headline": "Trump’s Occupation Of D.C. Fuels Calls For Statehood", "is_sarcastic": 0}
{"headline": "Attorney General Bill Barr Denies Nation's Police Are Systemically Racist", "is_sarcastic": 0}
{"headline": "John Kelly Defends Jim Mattis Against 'Nasty' Trump Twitter Attack", "is_sarcastic": 0}
{"headline": "George Floyd's Brother To Congress: 'Stop The Pain'", "is_sarcastic": 0}
{"headline": "Democrats Unveil Police Reform Overhaul, Kneel At Capitol To Honor George Floyd", "is_sarcastic": 0}
{"headline": "New York Legislature Votes To Repeal Law Shielding Police Disciplinary Records", "is_sarcastic": 0}
{"headline": "Sen. Susan Collins Loses Endorsement Of Major Gun Control Group", "is_sarcastic": 0}
{"headline": "NYT Staffers Slam Paper For Publishing Senator's 'Send In The Troops' Op-Ed", "is_sarcastic": 0}
{"headline": "White House Security Barred Clergy From Holding Vigil Outside Church", "is_sarcastic": 0}
{"headline": "2020 Isn't 1968 And Donald Trump Isn't Richard Nixon", "is_sarcastic": 0}
{"headline": "Joe Biden Calls On Facebook To Change Political Speech Rules", "is_sarcastic": 0}
{"headline": "Trump White House Believes 'Defund The Police' Is A Political Gift", "is_sarcastic": 0}
{"headline": "Facebook To Label State-Controlled Media Organizations", "is_sarcastic": 0}
{"headline": "With Trump MIA, Senate Republicans Go It Alone On Police Reform Efforts", "is_sarcastic": 0}
{"headline": "Civil Rights Groups Sue Trump, Barr After Violent Dispersal Of Protesters Outside White House", "is_sarcastic": 0}
{"headline": "Evangelical Leader Calls On Denomination To Retire Gavel Named For Slaveholder", "is_sarcastic": 0}
{"headline": "Blind Voters Fear Loss Of Privacy With Shift To Mail Voting", "is_sarcastic": 0}
{"headline": "EPA Said Giving Polluters A Pass Protected Its Workers. Its Own Union Says That’s Gaslighting.", "is_sarcastic": 0}
{"headline": "Retired General Spots Exact Moment The American Experiment Started To Crumble", "is_sarcastic": 0}
{"headline": "Barack And Michelle Obama Advise Graduates How To Utilize Turmoil", "is_sarcastic": 0}
{"headline": "Public Opinion Is On The Side Of The Protests. That's New.", "is_sarcastic": 0}
{"headline": "Biden Campaign Says He Doesn't Support Defunding The Police", "is_sarcastic": 0}
{"headline": "Police Violence Videos Thwarting Officers Attempts To Control Narrative", "is_sarcastic": 0}
{"headline": "Trump's Approval Among White Catholics Has Slipped", "is_sarcastic": 0}
{"headline": "Wisconsin Gym Under Fire For 'I Can't Breathe' Workout", "is_sarcastic": 0}
{"headline": "Jon Ossoff Wins Democratic Senate Nomination in Georgia", "is_sarcastic": 0}
{"headline": "States Have Put 54 New Restrictions On Peaceful Protests Since Ferguson", "is_sarcastic": 0}
{"headline": "Twitter Axes 32,000 State-Linked Propaganda Accounts From Russia, China And Turkey", "is_sarcastic": 0}
{"headline": "Politicians Praise Supreme Court’s Decision On LGBTQ Worker Protections", "is_sarcastic": 0}
{"headline": "Anti-Racism Protests Held Coast To Coast Across U.S.", "is_sarcastic": 0}
{"headline": "Trump Is Back To Business As Usual As Virus Surges In States", "is_sarcastic": 0}
{"headline": "John Kelly Slams Trump's Ethics: 'We Need To Look Harder At Who We Elect'", "is_sarcastic": 0}
{"headline": "Nancy Pelosi Calls For Removing Confederate Statues From U.S. Capitol", "is_sarcastic": 0}
{"headline": "Teacher Ousts West Virginia State Senate Leader In GOP Primary", "is_sarcastic": 0}
{"headline": "Guardsman Told Barr Protest Was Peaceful Before Violent Attack, Lawmaker Says", "is_sarcastic": 0}
{"headline": "Former DEA Spokesman Admits To Posing As 'Deep-Cover' CIA Agent In Fraud Scheme", "is_sarcastic": 0}
{"headline": "Democrats Knock GOP Police Reform Bill, Call For 'Improvement'", "is_sarcastic": 0}
{"headline": "Virginia Governor To Propose Juneteenth As State Holiday", "is_sarcastic": 0}
{"headline": "Joe Biden And The DNC Raised $80 Million In May", "is_sarcastic": 0}
{"headline": "House Leadership Announces Upcoming Vote On D.C. Statehood", "is_sarcastic": 0}
{"headline": "George Floyd Survived The Coronavirus. Then The Police Killed Him.", "is_sarcastic": 0}
{"headline": "With Trump's Approval Plunging, Republicans Say It's Too Early To Panic", "is_sarcastic": 0}
{"headline": "Louisville City Council Bans No-Knock Warrants After Breonna Taylor’s Death", "is_sarcastic": 0}
{"headline": "Esper Reverses Course Again, Orders Troops Out Of D.C.", "is_sarcastic": 0}
{"headline": "Why I Protest", "is_sarcastic": 0}
{"headline": "Republicans Prove They Can Focus During A Pandemic... On Confirming Judges", "is_sarcastic": 0}
{"headline": "Twitter Users Point Out Hypocrisy Of Trump’s ‘No Kneeling’ Tweets About Protesting", "is_sarcastic": 0}
{"headline": "Trump's Former Defense Secretary Called Him A Threat To The Republic. The GOP Doesn't Care.", "is_sarcastic": 0}
{"headline": "Police Critics Secure Some Gains In 11th Day Of Racial Justice Protests", "is_sarcastic": 0}
{"headline": "With DACA In Peril, Black Dreamers Are Hoping For Equality And The Ability To Stay", "is_sarcastic": 0}
{"headline": "Congress Headed Toward Standoff On Police Reform", "is_sarcastic": 0}
{"headline": "Democrats Say Law Protecting LGBTQ Rights Still Needed Even After SCOTUS Victory", "is_sarcastic": 0}
{"headline": "Mark Cuban: White People 'Get Defensive' When Discussing White Privilege", "is_sarcastic": 0}
{"headline": "Trump’s Mar-a-Lago Broken Promise Does Not Affect His Ability To Vote From There", "is_sarcastic": 0}
{"headline": "Little Evidence Of Antifa Links In Protest Violence Prosecutions", "is_sarcastic": 0}
{"headline": "Justice Department Sets New Dates To Begin Executing Federal Inmates On Death Row", "is_sarcastic": 0}
{"headline": "Anna Wintour Apologizes For Race-Related 'Mistakes' In Vogue Magazine", "is_sarcastic": 0}
{"headline": "Voice Of America Denounces CDC For Blacklisting Reporters After White House Smear", "is_sarcastic": 0}
{"headline": "White House Has 'No Regrets' About Violently Clearing Nearby Protest", "is_sarcastic": 0}
{"headline": "Al Sharpton Announces March On Washington In August", "is_sarcastic": 0}
{"headline": "Trump On Police Chokeholds: 'Concept' Is 'Innocent, So Perfect,' But Should Be Ended", "is_sarcastic": 0}
{"headline": "Republicans Move Convention Events, Trump Nomination Acceptance To Jacksonville, Florida", "is_sarcastic": 0}
{"headline": "Minneapolis Mayor Booed After Saying He Wouldn't 'Abolish' Police Department", "is_sarcastic": 0}
{"headline": "D.C. Statehood Gains New Support Among Senate Democrats After Trump Occupation", "is_sarcastic": 0}
{"headline": "Black Tulsans Call Trump's Juneteenth Rally Plan 'A Slap In The Face'", "is_sarcastic": 0}
{"headline": "More Than 1,250 Ex-DOJ Workers Demand Probe Of AG Barr Over Protesters’ Removal", "is_sarcastic": 0}
{"headline": "Scientists Funded By Zuckerberg Group Warn Facebook 'Antithetical' To Their Mission", "is_sarcastic": 0}
{"headline": "Man Arrested In Shooting During Protest Of Spanish Conqueror Statue In Albuquerque", "is_sarcastic": 0}
{"headline": "Trump Won't 'Even Consider' Renaming Bases Named For Confederate Generals", "is_sarcastic": 0}
{"headline": "Many Police Aren’t Wearing Masks, Posing Yet Another Risk To Protesters In A Pandemic", "is_sarcastic": 0}
{"headline": "Scant Evidence For Trump Claim That Antifa Is Behind Protest Violence", "is_sarcastic": 0}
{"headline": "Trump Administration Hints At Support For A Smaller Unemployment Boost", "is_sarcastic": 0}
{"headline": "PG&E Pleads Guilty To Involuntary Manslaughter Of 84 People In Deadly California Fire", "is_sarcastic": 0}
{"headline": "Nebraska Democrats Renounce Their Senate Pick Over Comments", "is_sarcastic": 0}
{"headline": "Ex-Defense Secretary: ‘Time Has Come’ To Strip Military Bases Of Confederate Names", "is_sarcastic": 0}
{"headline": "Southern Baptists Report Biggest Single Year Membership Drop In Decades", "is_sarcastic": 0}
{"headline": "Buffalo Mayor Says Police Union Is 'On The Wrong Side Of History'", "is_sarcastic": 0}
{"headline": "Tulsa Health Officials Urge Caution On Gatherings Just 1 Week Before Trump Rally", "is_sarcastic": 0}
{"headline": "AG Barr Defends Force Against D.C. Protesters, Says 'They Were Not Peaceful'", "is_sarcastic": 0}
{"headline": "1.5 Million More Americans Sought Unemployment Claims Last Week", "is_sarcastic": 0}
{"headline": "Sybrina Fulton, Trayvon Martin's Mother, Qualifies To Run For Public Office", "is_sarcastic": 0}
{"headline": "Naming Bases For Confederate Generals Is Like Having A Camp Bin Laden, Charges Vets' Ad", "is_sarcastic": 0}
{"headline": "Partisan Fault Lines Emerge In Congress Over Police Reform", "is_sarcastic": 0}
{"headline": "Supreme Court Declines To Hear Trump's Legal Challenge To 'Sanctuary' Laws", "is_sarcastic": 0}
{"headline": "Trump Sanctions War Crimes Court To Silence Investigations Into U.S. Misconduct", "is_sarcastic": 0}
{"headline": "Oklahoma Governor Invites Donald Trump To Visit Site Of Tulsa Race Massacre", "is_sarcastic": 0}
{"headline": "America Has Tried And Failed To Explain Its Racism To The World", "is_sarcastic": 0}
{"headline": "Republican Senator 'Absolutely' Supports National Ban On Police Chokeholds", "is_sarcastic": 0}
{"headline": "'Woefully Inadequate': Trump Order Falls Short Of Broader Push To Curb Cop Abuse", "is_sarcastic": 0}
{"headline": "American Police Are At War With Democracy Itself", "is_sarcastic": 0}
{"headline": "NYC Mayor Bill De Blasio Enforces Curfew Again, Setting Up Another Night Of Police Assaults", "is_sarcastic": 0}
{"headline": "Chris Hayes Goes To Town On ‘Morally Odious’ Bolton: Trying To 'Cash In On Betrayal'", "is_sarcastic": 0}
{"headline": "As Greens Reckon With Racism, Staff At A Major Group Challenge Pro-Trump Board Member", "is_sarcastic": 0}
{"headline": "The Coronavirus Is Still Spreading, Trump And Congress Are Still Dithering", "is_sarcastic": 0}
{"headline": "Trump Tweet Gets Personal Fact-Check From Twitter CEO Jack Dorsey", "is_sarcastic": 0}
{"headline": "Trump's Presidency Is Reaping What His White Grievance Politics Sowed", "is_sarcastic": 0}
{"headline": "'A Setup For Disaster': Doctors Issue Ominous Coronavirus Warnings About Trump Rally", "is_sarcastic": 0}
{"headline": "Extra Jobless Pay Helps People Eat, Says Budget Report Likely Dooming The Benefits", "is_sarcastic": 0}
{"headline": "White House Won't Say If Medical Professionals OK'd Trump Rally", "is_sarcastic": 0}
{"headline": "Boy Scouts Of America Will Require Eagle Scouts To Earn New Diversity Badge", "is_sarcastic": 0}
{"headline": "NY Police Union Boss Demands Respect For Officers After Brutal Protest Crackdowns", "is_sarcastic": 0}
{"headline": "John Bolton Aims To Publish Tell-All White House Memoir In June: Report", "is_sarcastic": 0}
{"headline": "Trump Praises His 'S.S.' For Protest Crackdown; Critics Go World War II", "is_sarcastic": 0}
{"headline": "Rubber Bullets Are Still Bullets", "is_sarcastic": 0}
{"headline": "Cuomo Warns He May Reverse Reopenings After New York Gets 25,000 Complaints", "is_sarcastic": 0}
{"headline": "Colin Powell Says He 'Cannot In Any Way' Support Trump, Will Vote For Joe Biden", "is_sarcastic": 0}
{"headline": "Don Lemon Exposes ‘White-Mansplaining’ Of Trump, White House Officials", "is_sarcastic": 0}
{"headline": "Donald Trump Has Made The U.S. ‘No Longer Safe,’ Elizabeth May Says", "is_sarcastic": 0}
{"headline": "The Fall Of America's Monuments To Racism", "is_sarcastic": 0}
{"headline": "Former U.S. Ambassador Jean Kennedy Smith Dies At 92", "is_sarcastic": 0}
{"headline": "Juneteenth Will Be An Official Holiday In New York City Starting In 2021", "is_sarcastic": 0}
{"headline": "5 Years After Charleston Church Shooting, South Carolina Protects Racist Monuments", "is_sarcastic": 0}
{"headline": "Video Shows 6 American Oil Executives Jailed In Venezuela", "is_sarcastic": 0}
{"headline": "William Barr Flatly Contradicts Trump's Story That He Was In His Bunker For 'Inspection'", "is_sarcastic": 0}
{"headline": "Some GOP Heavyweights Won't Vote To Reelect Trump: Report", "is_sarcastic": 0}
{"headline": "'Cops' Canceled Amid Nationwide Reckoning Over Police Violence", "is_sarcastic": 0}
{"headline": "Christopher Columbus Statue Beheaded In Boston Park", "is_sarcastic": 0}
{"headline": "Federal Prison Riot Team That Patrolled D.C. Streets Injured Colleagues In Training Exercises", "is_sarcastic": 0}
{"headline": "Obama Says We Should Learn 'Impatience' From Young Protesters", "is_sarcastic": 0}
{"headline": "In An Election Year, 2 Vulnerable GOP Senators Are Suddenly Conservationists", "is_sarcastic": 0}
{"headline": "Trump Campaign Says You Can't Sue If You Get COVID-19 At His Rally", "is_sarcastic": 0}
{"headline": "In Veto-Proof Majority, Minneapolis City Council Says It Will Dismantle Police Department", "is_sarcastic": 0}
{"headline": "'A Shocking Dereliction Of Duty': Supreme Court Brushes Off Police Immunity Cases", "is_sarcastic": 0}
{"headline": "Statues Linked To Racist Past Toppled And Vandalized Around The U.S.", "is_sarcastic": 0}
{"headline": "Federal Agents Release Coronavirus Masks Seized From Black Lives Matter Protesters", "is_sarcastic": 0}
{"headline": "Public Opinion On Taking Down Confederate Monuments Hasn't Budged In The Last Three Years", "is_sarcastic": 0}
{"headline": "The Police Have Been Spying On Black Reporters And Activists For Years. I Know Because I’m One Of Them.", "is_sarcastic": 0}
{"headline": "Banksy's New Anti-Racism Artwork Sets Fire To The American Flag", "is_sarcastic": 0}
{"headline": "Atlanta Police Officers Call Out Of Work After Officers Charged In Rayshard Brooks Case", "is_sarcastic": 0}
{"headline": "Interior Dept. Consulted ‘Junk Science’ Troll On ‘Transparency’ Rule, Emails Show", "is_sarcastic": 0}
{"headline": "50 Years After MLK, Pastors Lead A New Poor People's March", "is_sarcastic": 0}
{"headline": "It’s ‘Clear’ Firing Someone For Being Gay Is Wrong, Gorsuch Says In Title VII Opinion", "is_sarcastic": 0}
{"headline": "Judge Doubts White House Can Keep Bolton Book Away From Public", "is_sarcastic": 0}
{"headline": "Trump Shares Letter Saying White House Protesters Are 'Terrorists'", "is_sarcastic": 0}
{"headline": "Trump Tries To Explain Awkward West Point Walk That Lit Up Twitter Critics", "is_sarcastic": 0}
{"headline": "Lindsey Graham In New Ad: 'Joe Biden Is As Good A Man As God Ever Created'", "is_sarcastic": 0}
{"headline": "Historic Anti-Lynching Legislation Blocked In The Senate By Rand Paul", "is_sarcastic": 0}
{"headline": "Trump Reverses Rule Protecting Transgender Patients From Discrimination", "is_sarcastic": 0}
{"headline": "WaPost Board: Pence Destroys Own Credibility By Ignoring Coronavirus Reality", "is_sarcastic": 0}
{"headline": "Lara Trump Insists President Has No Health Issues Despite Awkward Ramp Walk", "is_sarcastic": 0}
{"headline": "Tear Gas Is Banned In Warfare But Not Against Protesters. A New Bill Could Change That.", "is_sarcastic": 0}
{"headline": "Chilling New Footage Shows Police Officer Ignoring Pleas To Help George Floyd", "is_sarcastic": 0}
{"headline": "Florida Hits Biggest Daily COVID-19 Jump As It Gears Up For GOP Convention", "is_sarcastic": 0}
{"headline": "Amid Racial Justice Marches, GOP Advances Trump Court Pick Hostile To Civil Rights", "is_sarcastic": 0}
{"headline": "List For Biden’s VP Pick Narrows Down To Warren, Harris, Susan Rice And More", "is_sarcastic": 0}
{"headline": "Secret Service Finally Admits It Used Pepper Spray On Protesters Before Trump Church Pic", "is_sarcastic": 0}
{"headline": "Protesters Light Fire Inside Wendy's Where Atlanta Police Killed Black Man", "is_sarcastic": 0}
{"headline": "Trump Suggests Stopping COVID-19 Tests Would Result In Fewer Cases", "is_sarcastic": 0}
{"headline": "George Conway Gets Twitter Users To Offer Trump Some All-Too-Honest New Slogans", "is_sarcastic": 0}
{"headline": "George Conway's Group Says 'Coward' Trump Just 'Became What We Always Feared'", "is_sarcastic": 0}
{"headline": "Trump Campaign Demands CNN Apologize For Poll That Shows Him Losing To Biden", "is_sarcastic": 0}
{"headline": "Trump’s Niece To Publish Tell-All Including ‘Salacious’ Details About President: Report", "is_sarcastic": 0}
{"headline": "White House Steps Up Effort To Downplay Coronavirus Concerns", "is_sarcastic": 0}
{"headline": "Oakland School Board Votes To Eliminate Its Police Department", "is_sarcastic": 0}
{"headline": "Trump Is ‘Too Small To Meet The Moment’ In New Biden Attack Ad", "is_sarcastic": 0}
{"headline": "The Democratic Party Launches Its First 2020 Ad Campaign Targeting Trump", "is_sarcastic": 0}
{"headline": "Tom Cotton Accidentally Gives The Washington Monument An Awesome New Name", "is_sarcastic": 0}
{"headline": "Texas Lt. Gov: Racism Won’t Stop Until We ‘Accept Jesus Christ’", "is_sarcastic": 0}
{"headline": "Progressive Charles Booker Unveils First Big Ad Buy In Race To Oust Mitch McConnell", "is_sarcastic": 0}
{"headline": "Why The U.S. Needs To Do Reparations Now", "is_sarcastic": 0}
{"headline": "Donald Trump Pokes At Roger Goodell For Encouraging NFL Player Protests", "is_sarcastic": 0}
{"headline": "Trump 'Exploited Sacred Symbols,' Says Church Where He Married Melania", "is_sarcastic": 0}
{"headline": "American Policing Has Always Been About Enforcing White Supremacy", "is_sarcastic": 0}
{"headline": "Police Budgets Have Long Been Untouchable. That Could Change.", "is_sarcastic": 0}
{"headline": "The Cops Who Killed Breonna Taylor Are Still Free", "is_sarcastic": 0}
{"headline": "The Supreme Court’s Landmark LGBTQ Rights Decision Didn't Address One Crucial Thing", "is_sarcastic": 0}
{"headline": "'Coward And Commander': Jim Mattis Attack On Trump Stars In Lacerating Ad", "is_sarcastic": 0}
{"headline": "Atlanta Police Chief Resigns After Cop Kills Black Man At A Wendy's (UPDATE)", "is_sarcastic": 0}
{"headline": "Trump Administration Says It's Not Forcing People Back To Work. Workers Disagree.", "is_sarcastic": 0}
{"headline": "Trump Defends Racist Phrase By Citing Philadelphia's Infamous ‘Vote White’ Mayor", "is_sarcastic": 0}
{"headline": "Police Video Shows Rayshard Brooks Sobriety Test Quickly Turning Deadly", "is_sarcastic": 0}
{"headline": "Fox News is Lying About Seattle’s ‘Autonomous Zone’", "is_sarcastic": 0}
{"headline": "The Labor Movement Faces A Reckoning Over Police Unions", "is_sarcastic": 0}
{"headline": "The Real Violent Extremist Threat Growing During Protests", "is_sarcastic": 0}
{"headline": "Tucker Carlson Rails Against Elmo And His Dad In Bonkers New Rant", "is_sarcastic": 0}
{"headline": "Tennessee Lawmakers Vote To Keep KKK Leader’s Bust In Capitol, Igniting Protests", "is_sarcastic": 0}
{"headline": "Twitter Adds 'Manipulated Media' Tag To Trump Tweet About 'Racist Baby'", "is_sarcastic": 0}
{"headline": "Donald Trump Makes Case For Joe Biden In Crazed All-Caps Tweet", "is_sarcastic": 0}
{"headline": "Donald Trump Jr.'s Mongolia Hunting Trip Cost Taxpayers $77,000", "is_sarcastic": 0}
{"headline": "Justin Trudeau Takes A Knee During Anti-Racism Protest", "is_sarcastic": 0}
{"headline": "Millions Of Taxpayer Dollars Are Going To Schools That Push Conversion Therapy", "is_sarcastic": 0}
{"headline": "Charles Booker Hits Amy McGrath For Skipping Anti-Racism Protests In New Kentucky Senate Ad", "is_sarcastic": 0}
{"headline": "Trump Takes Vindictive Swipe At GOP Senator Opposing Him, Endorses Anyone ‘Good Or Bad’", "is_sarcastic": 0}
{"headline": "Anderson Cooper Debunks Trump's Latest Coronavirus Claim With Basic Child Psychology", "is_sarcastic": 0}
{"headline": "Obama Photographer Takes Not-So-Subtle Swipe At Donald Trump's Bible Stunt", "is_sarcastic": 0}
{"headline": "Trump Moves Tulsa Rally So It Won't Fall On Juneteenth", "is_sarcastic": 0}
{"headline": "Trump Erupts After Attack Target Lisa Page Joins MSNBC As National Security Analyst", "is_sarcastic": 0}
{"headline": "West Virginia Elects Its First Out Transgender Official", "is_sarcastic": 0}
{"headline": "Republicans Running Anti-China Campaigns Shrug Off Trump Seeking China Reelection Help", "is_sarcastic": 0}
{"headline": "GOP Senator Tells Trump Fans At High Risk For Coronavirus To Skip Rally", "is_sarcastic": 0}
{"headline": "Roger Goodell Admits NFL Was Wrong About Player Protests", "is_sarcastic": 0}
{"headline": "Anderson Cooper Dismantles Kayleigh McEnany’s ‘Like Churchill’ Defense Of Trump", "is_sarcastic": 0}
{"headline": "Trump Campaign’s Plea For Video Messages To Celebrate President’s Birthday Backfires", "is_sarcastic": 0}
{"headline": "As Many As 35 Million People Haven't Yet Received Stimulus Checks", "is_sarcastic": 0}
{"headline": "John Cleese Mocks Fox News For Confusing Monty Python With CHAZ Protesters", "is_sarcastic": 0}
{"headline": "TikTok Comedian Sarah Cooper Spills Secrets On Lip-Synching Trump In Jimmy Fallon Interview", "is_sarcastic": 0}
{"headline": "Don Winslow Exposes The Art Of Trump’s Fake Victory Lap", "is_sarcastic": 0}
{"headline": "Trump Demeans Female Black Reporter As She Challenges Him On Black Unemployment", "is_sarcastic": 0}
{"headline": "The Police Are Targeting Protest Medics", "is_sarcastic": 0}
{"headline": "Most Americans Want Police Reform But Don't Back 'Defund The Police'", "is_sarcastic": 0}
{"headline": "Comedy Gem Sarah Cooper Conquers Trump In Hilarious TikTok Videos", "is_sarcastic": 0}
{"headline": "Joe Biden Has Problems He Can’t Solve From His Basement", "is_sarcastic": 0}
{"headline": "Trump Administration Sues To Block Release Of Bolton Book", "is_sarcastic": 0}
{"headline": "Trump Rally Not Welcome Here, Snaps Tulsa Newspaper Editorial", "is_sarcastic": 0}
{"headline": "Udder Failure: Devin Nunes Can't ID Critics Behind Cow Tweets, So Suit Appears Moot", "is_sarcastic": 0}
{"headline": "Republican Group Says Trump Just Became The 'Confederacy's Second President'", "is_sarcastic": 0}
{"headline": "Supercut Exposes The Ugly Truth Of Trump’s Rhetoric On Protests", "is_sarcastic": 0}
{"headline": "Donald Trump’s Race Speech In Tulsa Will Be Just Another Sop To His White Supporters", "is_sarcastic": 0}
{"headline": "U.S. Embassy in Seoul, South Korea, Unfurls Giant Black Lives Matter Banner", "is_sarcastic": 0}
{"headline": "Joe Biden Mocked In Trump Campaign Ad For Kneeling — In A Church", "is_sarcastic": 0}
{"headline": "Protest Cost Him His Career. Still, Mahmoud Abdul-Rauf Urges On The Protesters", "is_sarcastic": 0}
{"headline": "Ex-Judge Says Push To Dismiss Flynn Case Is 'Abuse Of Power'", "is_sarcastic": 0}
{"headline": "Trump Gloats That It's 'A Great Day' For George Floyd During Press Conference", "is_sarcastic": 0}
{"headline": "Ex-Defense Secretary: White House ‘Leading Us Down The Trail Toward A Dictatorship'", "is_sarcastic": 0}
{"headline": "Woman Who Praised KKK Apologizes, Vows To Never Wave Confederate Flag Again", "is_sarcastic": 0}
{"headline": "GAME OF THRONES", "is_sarcastic": 0}
{"headline": "COMEDY", "is_sarcastic": 0}
{"headline": "NETFLIX", "is_sarcastic": 0}
{"headline": "CHRISSY TEIGEN", "is_sarcastic": 0}
{"headline": "MEGHAN MARKLE", "is_sarcastic": 0}
{"headline": "Brendon Urie Shreds Trump For Using Panic! At The Disco Song At Arizona Rally", "is_sarcastic": 0}
{"headline": "Jon Stewart Names The Biden Trait That 'In This Moment, This Country Needs'", "is_sarcastic": 0}
{"headline": "Jennifer Aniston Jokes About 'Friends' Frustration: 'Stop Playing That F**king Show'", "is_sarcastic": 0}
{"headline": "Feds Set To Cut Coronavirus Testing Funds As COVID-19 Cases Soar", "is_sarcastic": 0}
{"headline": "Young Gay Liberal Leads Homophobic Preacher In Heated New York U.S. House Race", "is_sarcastic": 0}
{"headline": "Daily Coronavirus Cases Once Again At Peak As Lockdown Measures Lift", "is_sarcastic": 0}
{"headline": "Appeals Court Forces Dismissal Of Michael Flynn Case Over Judge's Objections", "is_sarcastic": 0}
{"headline": "Anti-Mask Floridians Hurl Conspiracy Theories At Officials In Wild Public Meeting", "is_sarcastic": 0}
{"headline": "Trump Notches His 200th Lifetime Federal Judge", "is_sarcastic": 0}
{"headline": "Nick Cordero's Wife Sees Him For First Time Since Coronavirus Hospitalization", "is_sarcastic": 0}
{"headline": "Here's A Montage Of Trump Saying Dumb Stuff, Then Saying He Was Joking", "is_sarcastic": 0}
{"headline": "Terry Crews Flexes With 73-Year-Old Bodybuilder On 'America's Got Talent'", "is_sarcastic": 0}
{"headline": "Mitch McConnell Is A Spineless Garden Pest In Jim Carrey’s Latest Artwork", "is_sarcastic": 0}
{"headline": "Meghan Markle Has A Special High School Connection To Her Latest Volunteer Project", "is_sarcastic": 0}
{"headline": "Jon Stewart Admits He Failed At Diversity When Hiring ‘Daily Show’ Staff", "is_sarcastic": 0}
{"headline": "Chris D'Elia Dropped By Talent Agency, Managers After Sexual Misconduct Claims", "is_sarcastic": 0}
{"headline": "Penn Badgley Speaks Out On 'You' Co-Star Chris D'Elia's Sexual Misconduct Allegations", "is_sarcastic": 0}
{"headline": "Terry Crews: 'Brooklyn Nine-Nine’ Scraps Episodes After Police Brutality Protests", "is_sarcastic": 0}
{"headline": "George R.R. Martin Breaks His 'Game Of Thrones' Book Release Promise ... Again", "is_sarcastic": 0}
{"headline": "Contortionists Pull Off Mind-Blowing Act On 'America's Got Talent'", "is_sarcastic": 0}
{"headline": "Delroy Lindo Is Finally Getting His Due", "is_sarcastic": 0}
{"headline": "Britney Spears' Shoutout For LGBTQ Pride Month Gets Interrupted", "is_sarcastic": 0}
{"headline": "In 'Death In Her Hands,' The Cure For Loneliness Is A Good Murder", "is_sarcastic": 0}
{"headline": "'Gone With The Wind' Back On HBO Max But With More Historical Context", "is_sarcastic": 0}
{"headline": "Colbert Hits 'Naive' Bolton Over Trump In Blunt Q&A: 'How Did You Not Know?'", "is_sarcastic": 0}
{"headline": "Winona Ryder Says Keanu Reeves Refused To Yell Insults At Her To Make Her Cry", "is_sarcastic": 0}
{"headline": "Evanna Lynch Warns About Unhealthy 'Harry Potter' Fan Culture", "is_sarcastic": 0}
{"headline": "Barcelona Opera House Reopens With Concert For 2,292 Plants", "is_sarcastic": 0}
{"headline": "Miley Cyrus Says She's Been Sober For 6 Months After Vocal Cord Surgery", "is_sarcastic": 0}
{"headline": "Stephen Colbert Gives Trump's Failed Tulsa Rally An 'Oklahoma!' Twist", "is_sarcastic": 0}
{"headline": "Alfalfa From ‘Little Rascals’ Arrested After Overdose Report", "is_sarcastic": 0}
{"headline": "Jimmy Kimmel Apologizes After Blackface Sketches Resurface", "is_sarcastic": 0}
{"headline": "Is 'Watchmen' Copaganda Or A Case For Abolition?", "is_sarcastic": 0}
{"headline": "Laverne Cox Is Auctioning Off Her Rainbow Emmys Clutch For A Great LGBTQ Cause", "is_sarcastic": 0}
{"headline": "Charlize Theron Reveals True Nature Of Sean Penn Relationship", "is_sarcastic": 0}
{"headline": "Megan Fox Denies Being 'Preyed' On By Michael Bay In Post About Hollywood Misogyny", "is_sarcastic": 0}
{"headline": "Winona Ryder Says Mel Gibson Once Called Her An 'Oven Dodger'", "is_sarcastic": 0}
{"headline": "Tina Fey Gets '30 Rock' Episodes With Blackface Removed From Viewing", "is_sarcastic": 0}
{"headline": "Singer Trey Pearson's New Pride Anthem Celebrates Larry Kramer's Legacy", "is_sarcastic": 0}
{"headline": "Fake Melania Fears She’s Next ‘Lifeless Monument To White Supremacy’ To Be Torn Down", "is_sarcastic": 0}
{"headline": "Late Show Hosts Dissect Trump’s Tulsa Rally For The Many Voters Who Didn't Go", "is_sarcastic": 0}
{"headline": "Trevor Noah Makes A Bleak Observation About Trump's Post-Rally Mood", "is_sarcastic": 0}
{"headline": "Jennifer Aniston And Lisa Kudrow Dish Hilarious Memories From Filming 'Friends'", "is_sarcastic": 0}
{"headline": "Thousands Want Columbus, Ohio, To Honor Guy Fieri By Changing Its Name To 'Flavortown'", "is_sarcastic": 0}
{"headline": "Pink Says She And Her Husband ‘Would Not Be Together’ Without Counseling", "is_sarcastic": 0}
{"headline": "Jimmy Kimmel Slammed For Sexual Joke About Underage Megan Fox In Old Clip", "is_sarcastic": 0}
{"headline": "John Oliver Mocks Saddest Thing About Trump's Tulsa Rally Attendance", "is_sarcastic": 0}
{"headline": "Anderson Cooper And Andy Cohen Marked Father's Day By Introducing Their Sons", "is_sarcastic": 0}
{"headline": "Kate Middleton Took The Cutest Pics Of William And The Cambridge Kids", "is_sarcastic": 0}
{"headline": "Joel Schumacher, Versatile Director Of Batman Films And 'St Elmo's Fire,' Dies At 80", "is_sarcastic": 0}
{"headline": "Whitney Cummings 'Enraged' At 'Predatory' Ex-Co-Star Chris D'Elia", "is_sarcastic": 0}
{"headline": "UFC Fighter Urges Handlers To Stop Fight REPEATEDLY. They Don’t Listen.", "is_sarcastic": 0}
{"headline": "Teddy Roosevelt Statue Gets Evicted From Outside Museum Of Natural History", "is_sarcastic": 0}
{"headline": "Chris Wallace Chews Out Trump Adviser For Denying Reality Of 'Empty' Tulsa Rally", "is_sarcastic": 0}
{"headline": "Public Enemy Tells 'Dictator' Trump To ‘Shut The F**k Up' In Explosive New Song", "is_sarcastic": 0}
{"headline": "Jon Stewart Says He Should've Axed Steve Carell From 'The Daily Show' 'A Month In'", "is_sarcastic": 0}
{"headline": "Trevor Noah Shows Why 'Trump Might Be More Ignorant Than We Thought'", "is_sarcastic": 0}
{"headline": "Kate Middleton Makes Her First Public Appearance Since March Lockdown", "is_sarcastic": 0}
{"headline": "AMC Theatres Says It Won't Require Face Masks To Avoid 'Political Controversy' [UPDATE]", "is_sarcastic": 0}
{"headline": "Matt Damon Interrupts Jimmy Kimmel’s Big Announcement And... Umm... Wow", "is_sarcastic": 0}
{"headline": "See Jamie Foxx As Mike Tyson For Boxer Biopic", "is_sarcastic": 0}
{"headline": "Stephen Colbert Shreds Trump's Supreme Court Gripe With A KKK Zinger", "is_sarcastic": 0}
{"headline": "12-Year-Old ‘This Is Us' Star Reveals The Racism He’s Already Experienced", "is_sarcastic": 0}
{"headline": "New Sylvester Documentary Celebrates The Life Of Queer Black Disco Legend", "is_sarcastic": 0}
{"headline": "Singer Pablo Alborán Comes Out As Gay, Vows To Be '100% True To Myself'", "is_sarcastic": 0}
{"headline": "Billie Eilish Gets 3-Year Restraining Order For Trespasser", "is_sarcastic": 0}
{"headline": "Leah Remini: Danny Masterson Rape Charges Are Beginning Of The End For Scientology", "is_sarcastic": 0}
{"headline": "This Is How Much Money Cookbook Authors Can Actually Make", "is_sarcastic": 0}
{"headline": "So THAT’S Why Cold Brew And Hot-Brewed Coffee Taste Different", "is_sarcastic": 0}
{"headline": "If You Still Don’t Get Why COVID-19 Hit Black People Harder, Read This", "is_sarcastic": 0}
{"headline": "Minneapolis Chef: ‘Enough Is Enough’ With ‘Blatant Racism’ In Restaurants", "is_sarcastic": 0}
{"headline": "6 Easy Ways To Make Your Coffee Taste Like It Came From The Coffee Shop", "is_sarcastic": 0}
{"headline": "11 Easy Ways You Can Save Time On Meal Prep", "is_sarcastic": 0}
{"headline": "How To Make Japanese Iced Coffee: It’s Like Cold Brew, But Way Faster", "is_sarcastic": 0}
{"headline": "‘Food Apartheid In This Country Didn’t Just Happen. It Happened By Design.’", "is_sarcastic": 0}
{"headline": "JJ Johnson: Black Cooks Aren’t ‘Looking For Charity’", "is_sarcastic": 0}
{"headline": "For A Real Breakthrough, ‘White People Need To Work This Out Amongst Themselves’", "is_sarcastic": 0}
{"headline": "8 Coffee Subscription Services That Are Perfect For Life Right Now", "is_sarcastic": 0}
{"headline": "I Bought Half A Pig During The Coronavirus Pandemic. Now What?", "is_sarcastic": 0}
{"headline": "‘There Is Obviously A Race Issue In Food. I’ve Personally Dealt With It.’", "is_sarcastic": 0}
{"headline": "24 Black Food Bloggers And Chefs To Follow On Instagram Right Now", "is_sarcastic": 0}
{"headline": "What To Bake After Banana Bread: A Choose-Your-Own Adventure Guide", "is_sarcastic": 0}
{"headline": "‘Real Systemic Change Requires That We Have A Seat At The Table’", "is_sarcastic": 0}
{"headline": "What You Should Know Before Raising Backyard Chickens During Lockdown", "is_sarcastic": 0}
{"headline": "A Black-Owned Distillery Was Set On Fire In Minneapolis. Here’s How The Owner Responded.", "is_sarcastic": 0}
{"headline": "Food Pantries Struggle To Feed The Hungry Amid Protests. Here’s How You Can Help.", "is_sarcastic": 0}
{"headline": "One Woman Is Baking Pies — And Giving Them Away — For A Grieving Minneapolis", "is_sarcastic": 0}
{"headline": "The 10 Most-Loved Instagram Recipes From May", "is_sarcastic": 0}
{"headline": "How To Use All The Food In Your Refrigerator To Prevent Waste", "is_sarcastic": 0}
{"headline": "Why Wearing Gloves To The Grocery Store Won’t Protect You From COVID-19", "is_sarcastic": 0}
{"headline": "6 Unsung Black Culinary Heroes Of The Past", "is_sarcastic": 0}
{"headline": "If ‘Murder Hornets’ Kill Honeybees, Will They Destroy Our Food And Honey Supply?", "is_sarcastic": 0}
{"headline": "Do You REALLY Need To Refrigerate Nut Butter?", "is_sarcastic": 0}
{"headline": "Light Red Wines: What To Drink When You’re Over Rosé", "is_sarcastic": 0}
{"headline": "31 Ridiculously Easy Summer Desserts To Make This Weekend", "is_sarcastic": 0}
{"headline": "8 Foods That Could Be Putting You In A Bad Mood", "is_sarcastic": 0}
{"headline": "Why Now Is The Best Time To Get A Meat Subscription Box", "is_sarcastic": 0}
{"headline": "Turn Up The Heat With These Electric Indoor Grills On Amazon For Under $100", "is_sarcastic": 0}
{"headline": "We Found Father's Day Gifts For Dads Who Miss Going To Restaurants", "is_sarcastic": 0}
{"headline": "Michael Twitty: Hunger Is A Form Of Violence We Must Address", "is_sarcastic": 0}
{"headline": "The Best Father’s Day Gifts For The Dad Who’s A Self-Proclaimed Grill Master", "is_sarcastic": 0}
{"headline": "Bon Appetit Apologizes For Being 'Too White,' Promises Big Changes", "is_sarcastic": 0}
{"headline": "20 Black-Owned Foods And Beverages You Can Shop Online", "is_sarcastic": 0}
{"headline": "Is It Safe To Buy Food At The Farmers Market During The Pandemic?", "is_sarcastic": 0}
{"headline": "How To Make Perfect Jammy Eggs Every Time", "is_sarcastic": 0}
{"headline": "The Most Popular Food Delivery Orders In Every State Amid Coronavirus", "is_sarcastic": 0}
{"headline": "This Is How Buffets And Salad Bars Plan To Survive After COVID-19", "is_sarcastic": 0}
{"headline": "32 Mouthwatering Vegan Recipes For Your Memorial Day Cookout", "is_sarcastic": 0}
{"headline": "Here's How Much Protein You'll Get From Plant-Based Protein Sources", "is_sarcastic": 0}
{"headline": "Maryland Restaurant Using 'Bumper Tables' To Bounce Back From Lockdown", "is_sarcastic": 0}
{"headline": "These Are The Most-Searched Coronavirus Cocktails In Every State", "is_sarcastic": 0}
{"headline": "41 New Recipes To Inspire A Delicious 2020 Memorial Day Menu", "is_sarcastic": 0}
{"headline": "The Best Charcoal Grills And Charcoal, According To Grill Masters", "is_sarcastic": 0}
{"headline": "Chuck E. Cheese Tricks Grubhub Customers With Sneaky New Name", "is_sarcastic": 0}
{"headline": "This Japanese Term Perfectly Describes Why We're All Eating Mindlessly Right Now", "is_sarcastic": 0}
{"headline": "How To Nail The 'Pull Shot,' According To Food Instagrammers", "is_sarcastic": 0}
{"headline": "Hong Kong Shop Selling 'Tear Gas' Ice Cream To Support Democratic Protests", "is_sarcastic": 0}
{"headline": "33 Easy Vegan Dinner Recipes You'll Fall In Love With", "is_sarcastic": 0}
{"headline": "The Best Way To Use Every Kind Of Vinegar You Have In Your Pantry", "is_sarcastic": 0}
{"headline": "Black Light Shows How Easily Coronavirus Could Spread At A Buffet", "is_sarcastic": 0}
{"headline": "The Safest Ways To Defrost That Meat You've Frozen", "is_sarcastic": 0}
{"headline": "10 Photos Show How Restaurants Around The World Are Social Distancing", "is_sarcastic": 0}
{"headline": "6 Ways Restaurants Will Be Different When They Reopen After COVID Closures", "is_sarcastic": 0}
{"headline": "Food Fraud Is Real. Here's How To Detect Mislabeled Foods.", "is_sarcastic": 0}
{"headline": "Why You Can’t Find Flour At Grocery Stores, And Where To Buy It Online", "is_sarcastic": 0}
{"headline": "Food Influencers Get Real About The Not-So-Fun Parts Of Their Job", "is_sarcastic": 0}
{"headline": "Is It Safe To Eat Eggs With Blood Spots Or Other Weird Defects?", "is_sarcastic": 0}
{"headline": "4 Food Bloggers Reveal How Much Money They Earn To Develop A Recipe", "is_sarcastic": 0}
{"headline": "How To Choose The Healthiest Quarantine Snacks, According To Nutritionists", "is_sarcastic": 0}
{"headline": "The Olive Chicken Recipe That Restored My Faith in Cooking", "is_sarcastic": 0}
{"headline": "Simple Ways To Make Your Fresh Food Last Longer", "is_sarcastic": 0}
{"headline": "Why Reheated Coffee Tastes Like Death, And What To Do Instead", "is_sarcastic": 0}
{"headline": "The Peanut Butter Bread Recipes Everyone's Searching For", "is_sarcastic": 0}
{"headline": "25 Of The Best Cheesecake Recipes To Try At Home", "is_sarcastic": 0}
{"headline": "6 Foods With Expiration Dates You Can Probably Ignore", "is_sarcastic": 0}
{"headline": "10 Most-Loved Recipes People Cooked At Home In April", "is_sarcastic": 0}
{"headline": "Why Alison Roman Has Become A North Star For Pandemic-Era Cooking", "is_sarcastic": 0}
{"headline": "Avoid Buying These 7 Foods Now, And You Could Save Someone's Life", "is_sarcastic": 0}
{"headline": "Belgian Officials Urging Citizens To Double Their Intake Of Fries", "is_sarcastic": 0}
{"headline": "The Best Kinds Of Canned Tuna For Your Health, According To Experts", "is_sarcastic": 0}
{"headline": "Nancy Meyers Shares The Photo Of Her Kitchen You've Always Wanted", "is_sarcastic": 0}
{"headline": "25 Of The Best Cooking Gifts For Moms Who Love To Cook", "is_sarcastic": 0}
{"headline": "Homemade Dog Treat Recipes, Because Your Pet Deserves Some Thanks", "is_sarcastic": 0}
{"headline": "Out Of Flour? Make These 19 Flourless Desserts.", "is_sarcastic": 0}
{"headline": "2020 Was Going To Be The Year Of The Sober-Curious Movement. Now What?", "is_sarcastic": 0}
{"headline": "The Delivery Foods Americans Are Ordering More During Lockdown", "is_sarcastic": 0}
{"headline": "10 Smart Substitutes For Hard-To-Find Grocery Store Ingredients", "is_sarcastic": 0}
{"headline": "Will There Be A Meat Shortage Because Of The Coronavirus?", "is_sarcastic": 0}
{"headline": "14 Small Businesses That'll Deliver Food And Drink Straight To Your Door", "is_sarcastic": 0}
{"headline": "Chipotle Will Pay $25 Million Fine To Resolve Tainted Food Allegations", "is_sarcastic": 0}
{"headline": "Here's How To Make IKEA's Famed Swedish Meatballs", "is_sarcastic": 0}
{"headline": "Move Aside, Whipped Coffee — These 5 DIY Coffee Drinks Are Better", "is_sarcastic": 0}
{"headline": "My Baking Fails Have Made Me Laugh Till I Cry (And Temporarily Forget My Anxiety)", "is_sarcastic": 0}
{"headline": "15 Easy Instant Pot Recipes You Can Make With 5 Ingredients Or Less", "is_sarcastic": 0}
{"headline": "Feeling Anxious About The Supermarket Trip? Try These Expert-Approved Tips", "is_sarcastic": 0}
{"headline": "Sick Of Banana Bread Yet? Make These Banana Brownies Instead", "is_sarcastic": 0}
{"headline": "You're At Home Eating Egg Salad. Here's How To Make It Less Sad.", "is_sarcastic": 0}
{"headline": "17 No-Bake Desserts For Everyone Who's Too Exhausted To Bake", "is_sarcastic": 0}
{"headline": "Just A Reminder: This Is How Alcohol Affects Your Immune System", "is_sarcastic": 0}
{"headline": "Non-Alcoholic Cocktail Recipes For Your Next Virtual Happy Hour", "is_sarcastic": 0}
{"headline": "11 Crazy Easy Baking Recipes That Use Boxed Cake Mix", "is_sarcastic": 0}
{"headline": "5 Common Mistakes We Make With Deviled Eggs", "is_sarcastic": 0}
{"headline": "Missing Your Morning Latte? Here's Everything You Need To Make It At Home.", "is_sarcastic": 0}
{"headline": "How To Get Yeast When It's Sold Out At The Grocery Store", "is_sarcastic": 0}
{"headline": "If You're Not Eating Peeps Stale, You're Doing It Wrong", "is_sarcastic": 0}
{"headline": "For The First Time Ever, Le Creuset Is Having A Sale On All Its Full-Price Pieces", "is_sarcastic": 0}
{"headline": "This Dr. Pepper Glaze Will Forever Change Your Easter Ham", "is_sarcastic": 0}
{"headline": "Don't Wash Your Produce With Soap During Coronavirus. Here's Why.", "is_sarcastic": 0}
{"headline": "15 Easy Easter Recipes You Can Make In An Instant Pot", "is_sarcastic": 0}
{"headline": "Everyone's Making Sourdough Bread Now. Here's How To Do It.", "is_sarcastic": 0}
{"headline": "How To Buy An Easter Ham And Make It Stretch Through Lockdown", "is_sarcastic": 0}
{"headline": "Healthy Frozen Foods To Stock Up On, According To Nutritionists", "is_sarcastic": 0}
{"headline": "Are Reusable Grocery Bags Safe During The Coronavirus Outbreak?", "is_sarcastic": 0}
{"headline": "The Funniest Things Left On Grocery Store Shelves Right Now", "is_sarcastic": 0}
{"headline": "In The Spirit Of Spirits, Here's Everything You Need To Bring Happy Hour Home", "is_sarcastic": 0}
{"headline": "7 Free Virtual Cooking Classes To Take During Self-Isolation", "is_sarcastic": 0}
{"headline": "Everyone's Suddenly Into Baking, So We Found Stand Mixers On Sale For Under $200", "is_sarcastic": 0}
{"headline": "Ina Garten's Massive Cosmopolitan-For-One Recipe Is *Chef's Kiss*", "is_sarcastic": 0}
{"headline": "How To Cook Artichokes, Because There's No Better Time To Finally Learn", "is_sarcastic": 0}
{"headline": "25 Funny Tweets About Coronavirus Cooking Struggles", "is_sarcastic": 0}
{"headline": "The 10 Most Popular Instagram Recipes Since Coronavirus Lockdown", "is_sarcastic": 0}
{"headline": "We're Eating More Eggs Than Ever. Should We Avoid Eating The Yolks?", "is_sarcastic": 0}
{"headline": "18 Underrated Pantry Items To Buy At The Grocery Store", "is_sarcastic": 0}
{"headline": "A Grocer Reveals What It's Like To Run A Supermarket In A Pandemic", "is_sarcastic": 0}
{"headline": "How To Order Groceries Online To Avoid Going To The Store", "is_sarcastic": 0}
{"headline": "Grocery Delivery Is Overbooked. Here's What Companies Are Doing About It.", "is_sarcastic": 0}
{"headline": "The Best Virtual Wine Tastings To Join During Coronavirus Lockdown", "is_sarcastic": 0}
{"headline": "3 Ways To Support Restaurants Without Putting Delivery Workers At Risk", "is_sarcastic": 0}
{"headline": "8 Types Of Foods You Should Avoid Buying At The Farmers Market", "is_sarcastic": 0}
{"headline": "How To Disinfect Food And Your Kitchen For Coronavirus", "is_sarcastic": 0}
{"headline": "Can Eating Sugar Weaken Your Immune System? Here's What To Know.", "is_sarcastic": 0}
{"headline": "Now You Don't Even Have To Touch Someone For Your Takeout Or Food Delivery", "is_sarcastic": 0}
{"headline": "Here's What You've Been Cooking During Your Self-Quarantine", "is_sarcastic": 0}
{"headline": "Where To Stock Up On Wine, Beer And Alcohol While Social Distancing Without Going Broke", "is_sarcastic": 0}
{"headline": "How To Prioritize Your Pantry And Make Food Last Longer", "is_sarcastic": 0}
{"headline": "How To Eat Healthy While Working From Home", "is_sarcastic": 0}
{"headline": "How Italian Food Imports In The U.S. Will Be Affected By Coronavirus", "is_sarcastic": 0}
{"headline": "Breweries Hope Curbside Beer Sales Keep Things Hopping Despite COVID-19 Fears", "is_sarcastic": 0}
{"headline": "How To Safely Shop For Groceries Right Now", "is_sarcastic": 0}
{"headline": "17 Simple Food Swaps For When You Run Out Of Ingredients", "is_sarcastic": 0}
{"headline": "Is It Safe To Order Takeout Right Now?", "is_sarcastic": 0}
{"headline": "This Twist On Mac And Cheese Is The Ultimate St. Patrick's Day Dish", "is_sarcastic": 0}
{"headline": "Put Down The Guinness And Drink This Actualy Irish-Made Booze Instead", "is_sarcastic": 0}
{"headline": "Woman Who Praised KKK Apologizes, Vows To Never Wave Confederate Flag Again", "is_sarcastic": 0}
{"headline": "Dozens Of Secret Service Agents Reportedly Told To Quarantine After Tulsa Rally", "is_sarcastic": 0}
{"headline": "Oakland School Board Votes To Eliminate Its Police Department", "is_sarcastic": 0}
{"headline": "Anti-Mask Floridians Hurl Conspiracy Theories At Officials In Wild Public Meeting", "is_sarcastic": 0}
{"headline": "Brendon Urie Shreds Trump For Using Panic! At The Disco Song At Arizona Rally", "is_sarcastic": 0}
{"headline": "Appeals Court Forces Dismissal Of Michael Flynn Case Over Judge's Objections", "is_sarcastic": 0}
{"headline": "Jessi Combs Officially Recognized By Guinness As The Fastest Woman On Earth", "is_sarcastic": 0}
{"headline": "Jon Stewart Names The Biden Trait That 'In This Moment, This Country Needs'", "is_sarcastic": 0}
{"headline": "Jennifer Aniston Jokes About 'Friends' Frustration: 'Stop Playing That F**king Show'", "is_sarcastic": 0}
{"headline": "Nick Cordero's Wife Sees Him For First Time Since Coronavirus Hospitalization", "is_sarcastic": 0}
{"headline": "Daily Coronavirus Cases Once Again At Peak As Lockdown Measures Lift", "is_sarcastic": 0}
{"headline": "DOJ Whistleblowers Testify That William Barr Has Politicized Justice", "is_sarcastic": 0}
{"headline": "Democratic National Convention Will Be Almost Entirely Virtual", "is_sarcastic": 0}
{"headline": "Detroit Man Demands Police Department Abandon Face Recognition Technology", "is_sarcastic": 0}
{"headline": "3 Men Indicted By Grand Jury On Murder Charges In Killing Of Ahmaud Arbery", "is_sarcastic": 0}
{"headline": "Georgia Bill Would Stop Officials From Mailing Absentee Ballot Applications", "is_sarcastic": 0}
{"headline": "USCIS Prepares For Massive Staff Cuts In Blow To Legal Immigration System", "is_sarcastic": 0}
{"headline": "Trump Doubles Down On Calling COVID-19 'Kung Flu' In Phoenix Rally", "is_sarcastic": 0}
{"headline": "Minnesota Sues Exxon, Koch And API For Being 'Deceptive' On Climate Change", "is_sarcastic": 0}
{"headline": "Young Gay Liberal Leads Homophobic Preacher In Heated New York U.S. House Race", "is_sarcastic": 0}
{"headline": "Kentucky’s Election Wasn’t A Disaster, But It Exposed Problems In Pandemic-Era Voting", "is_sarcastic": 0}
{"headline": "Mississippi Attorney General Supports Changing State's Confederate-Themed Flag", "is_sarcastic": 0}
{"headline": "NY, NJ And Connecticut Order Visitors From New COVID Hot Spots To Quarantine", "is_sarcastic": 0}
{"headline": "Feds Set To Cut Coronavirus Testing Funds As COVID-19 Cases Soar", "is_sarcastic": 0}
{"headline": "Police Reform Stalls Out In The Senate", "is_sarcastic": 0}
{"headline": "Trump Notches His 200th Lifetime Federal Judge", "is_sarcastic": 0}
{"headline": "Rhode Island Takes Step Toward Removing 'Plantation' From Official Name", "is_sarcastic": 0}
{"headline": "New York City Marathon Canceled Due To Coronavirus", "is_sarcastic": 0}
{"headline": "New U.S. Coronavirus Cases Hit Highest Level In 2 Months", "is_sarcastic": 0}
{"headline": "Coronavirus Live Updates: Read The Latest About The COVID-19 Outbreak", "is_sarcastic": 0}
{"headline": "Bubba Wallace Debunks Noose Hoax Conspiracy Theories: 'I'm Pissed'", "is_sarcastic": 0}
{"headline": "Crowds Tear Down Statues At Wisconsin Capitol, Attack State Senator", "is_sarcastic": 0}
{"headline": "Georgia Lawmakers Pass Hate Crimes Legislation, More Police Protections", "is_sarcastic": 0}
{"headline": "Anderson Cooper Blasts ‘Biological Bunker’ Dweller Trump Over Coronavirus Hypocrisy", "is_sarcastic": 0}
{"headline": "Rachel Maddow Spells Out The Danger That Trump’s Rallies Pose To The World", "is_sarcastic": 0}
{"headline": "Madison Cawthorn, 24, Defeats Trump's Pick In North Carolina GOP Congressional Primary", "is_sarcastic": 0}
{"headline": "Donald Trump Jr. Desperately Tries To Spin His Dad's 'Walk Of Shame' Picture", "is_sarcastic": 0}
{"headline": "Trump's Bizarre COVID-19 Question Gets Plenty Of Answers On Twitter", "is_sarcastic": 0}
{"headline": "Obama Explains Why Democrats Can’t Afford To Get Smug About Trump", "is_sarcastic": 0}
{"headline": "Ex-Trump Aide Gorka Boasts About Not Wearing 'COVID Burqas' To Combat Coronavirus", "is_sarcastic": 0}
{"headline": "'Mass Murder': Trump's Coronavirus Confession Is Already Being Used In Attack Ads", "is_sarcastic": 0}
{"headline": "Trump Family Moves To Block Tell-All Written By President’s Niece", "is_sarcastic": 0}
{"headline": "Jamaal Bowman Ahead With Results Too Close To Call In Key New York House Race", "is_sarcastic": 0}
{"headline": "Woman Who Deliberately Coughed In Baby's Face Is Wanted By Police", "is_sarcastic": 0}
{"headline": "Trump Spends Rally Downplaying Coronavirus And Making Racist Jokes", "is_sarcastic": 0}
{"headline": "Dr. Cameron Webb Wins Democratic Nomination For U.S. House In Virginia", "is_sarcastic": 0}
{"headline": "First Patient To Receive Gene Editing Treatment For Sickle Cell Doing Well In 2020", "is_sarcastic": 0}
{"headline": "Donald Trump Is Using The Pandemic To Push His Anti-Immigration Agenda", "is_sarcastic": 0}
{"headline": "Noose Found In Garage Used By NASCAR’s Bubba Wallace Was There In 2019: FBI", "is_sarcastic": 0}
{"headline": "4 Years Later, Only 3 New Miles of 'Wall' And Not A Single Peso From Mexico", "is_sarcastic": 0}
{"headline": "Republicans Think The U.S. Should Speed Up -- Not Slow Down -- Coronavirus Testing", "is_sarcastic": 0}
{"headline": "Brazilian Judge Orders President Jair Bolsonaro To Wear Mask Due To COVID-19", "is_sarcastic": 0}
{"headline": "Porn Actor Ron Jeremy Accused of Raping 3 Women, Sexually Assaulting Another", "is_sarcastic": 0}
{"headline": "Roger Stone Prosecutor Says DOJ Leaders Applied ‘Heavy Pressure' To Cut Him A Break", "is_sarcastic": 0}
{"headline": "Google Workers Call For Company To Cease Selling Technology To Police Departments", "is_sarcastic": 0}
{"headline": "Democrats Threaten To Block 'Woefully Inadequate' GOP Police Reform Bill", "is_sarcastic": 0}
{"headline": "Kentucky And New York Hold Primaries Amid Concerns About Polling Site Closures", "is_sarcastic": 0}
{"headline": "U.S. coronavirus task force members: Trump hasn't asked us to slow testing", "is_sarcastic": 0}
{"headline": "Trump Says He Wasn't Joking About Slowing COVID-19 Testing: 'I Don't Kid'", "is_sarcastic": 0}
{"headline": "Powerful Earthquake Shakes Southern, Central Mexico", "is_sarcastic": 0}
{"headline": "Chuck Schumer Faces The Progressive Surge", "is_sarcastic": 0}
{"headline": "Fauci To Testify At A Fraught Time For U.S. Coronavirus Pandemic Response", "is_sarcastic": 0}
{"headline": "New U.S. COVID-19 Cases Surge 25%", "is_sarcastic": 0}
{"headline": "The South Has Some Of The Nation’s Dirtiest Electricity. Now It’s Seeing A Coronavirus Uptick.", "is_sarcastic": 0}
{"headline": "The R-Rated Art Campaign That’s A 2-Word 'Primal Scream’ Against Trump", "is_sarcastic": 0}
{"headline": "Police Pepper-Spray Protesters Trying To Pull Down Andrew Jackson Statue In DC", "is_sarcastic": 0}
{"headline": "Giuliani Says Black Lives Matter Wants To ‘Take Your House Away From You’", "is_sarcastic": 0}
{"headline": "Biden Campaign Commits To 3 General Election Debates", "is_sarcastic": 0}
{"headline": "Trump Says He's Issuing An Edict To 'Make Cities Guard Their Monuments'", "is_sarcastic": 0}
{"headline": "Saudi Arabia Says Hajj Will See At Most 'Thousands' Of Pilgrims Due To Virus", "is_sarcastic": 0}
{"headline": "Large Countries Are Lifting Lockdowns Even As Virus Cases Continue To Rise", "is_sarcastic": 0}
{"headline": "Donald Trump Makes 'Hustory' With Latest Weird Twitter Typo", "is_sarcastic": 0}
{"headline": "CNN's Dr. Sanjay Gupta: 'We Are Right Back To Square One' On Flattening The Curve", "is_sarcastic": 0}
{"headline": "Clueless Yosemite Bigwig Caught Using Protected Meadow For Golf", "is_sarcastic": 0}
{"headline": "Even Lou Dobbs Admits Trump's Rally In Tulsa Was 'A Mess'", "is_sarcastic": 0}
{"headline": "MSNBC Supercut Exposes Trump’s Go-To Defense Of His Outrageous Statements", "is_sarcastic": 0}
{"headline": "Schools Across U.S. Wonder How To Social Distance With Meager Budgets", "is_sarcastic": 0}
{"headline": "Watchdog Launches Probe Of Police Attacks On Protesters Before Trump Posed With Bible", "is_sarcastic": 0}
{"headline": "The Fed’s Coronavirus Spending On Fossil Fuel Could Dig A $19 Billion Money Pit", "is_sarcastic": 0}
{"headline": "Confederate Flag-Waving Trump Supporter Praises KKK, Vows To Teach Hate", "is_sarcastic": 0}
{"headline": "Republican Group Relentlessly Dunks On 'Disheveled' Post-Rally Trump In New Ad", "is_sarcastic": 0}
{"headline": "Trump Baselessly Accuses Obama Of ‘Treason’", "is_sarcastic": 0}
{"headline": "TikTok Comedian Knocks It Out Of The Arena Over Trump's 'Amazing' Fake Numbers", "is_sarcastic": 0}
{"headline": "Firing Of U.S. Attorney Highlights William Barr’s Pattern Of Misleading The Public", "is_sarcastic": 0}
{"headline": "Mike Pence Reportedly Voted Via 'Rigged' Mail System, Joining Other Officials (And Trump)", "is_sarcastic": 0}
{"headline": "Trump Expands Immigration Ban To Suspend Foreign Worker Visas", "is_sarcastic": 0}
{"headline": "Brexit Leader Allowed To Attend Trump Rally With A ‘National Interest’ Travel Ban Waiver", "is_sarcastic": 0}
{"headline": "NASCAR Drivers, Crew March In Solidarity With Bubba Wallace", "is_sarcastic": 0}
{"headline": "Neo-Nazi U.S. Soldier Faces Federal Terrorism Charges For Plotting Attack On Unit", "is_sarcastic": 0}
{"headline": "Surging U.S. Virus Cases Raise Fear That Progress Is Slipping", "is_sarcastic": 0}
{"headline": "More Young People Are Testing Positive For COVID-19, Particularly In The South", "is_sarcastic": 0}
{"headline": "How The Black Lives Matter Protests Are Shaking Up New York’s Primaries", "is_sarcastic": 0}
{"headline": "Trump Won't Say If He Really Asked For Coronavirus Testing To Slow Down", "is_sarcastic": 0}
{"headline": "We’ve Been Hosting Two Refugees During Lockdown. Here’s What We’ve Learned", "is_sarcastic": 0}
{"headline": "Trump Sitting On Funds Meant To Boost Coronavirus Testing, Top Democrats Say", "is_sarcastic": 0}
{"headline": "Why Health Care Workers Don’t Have Paid Sick Days During The Pandemic", "is_sarcastic": 0}
{"headline": "2 Lawyers Of Color Face 45-Year Sentences — For Vandalism", "is_sarcastic": 0}
{"headline": "Tulsa Rally Failure May Spark Trump Campaign Team Shakeup", "is_sarcastic": 0}
{"headline": "Trump Baselessly Claims 2020 Election Is 'RIGGED' Months Before Any Votes Are Cast", "is_sarcastic": 0}
{"headline": "Size Matters: Never-Trump GOP Group Dumps On President's Puny Rally In New Attack Ad", "is_sarcastic": 0}
{"headline": "NYPD Officer Suspended After Video Catches Him Using Illegal Chokehold On Black Man", "is_sarcastic": 0}
{"headline": "From Shops To Dining Out, New York City Gears Up For Next Reopening Phase", "is_sarcastic": 0}
{"headline": "Second Shooting In 48 Hours At Seattle Protest Zone Leaves 1 Wounded", "is_sarcastic": 0}
{"headline": "Virus Cases Surge In U.S., India, But Slow In China, Korea", "is_sarcastic": 0}
{"headline": "2 Dead, 7 Wounded In Shooting In Charlotte, North Carolina", "is_sarcastic": 0}
{"headline": "Michelle Obama Shares Sweet Family Throwback Photo For Father's Day", "is_sarcastic": 0}
{"headline": "'Walk Of Shame': Deflated Trump's Lonely Helicopter Walk Becomes Biting New Meme", "is_sarcastic": 0}
{"headline": "John Bolton Won’t Vote For Trump, Hopes He Will Be A ‘One-Term’ President", "is_sarcastic": 0}
{"headline": "Noose Found In Garage Used By NASCAR’s Bubba Wallace", "is_sarcastic": 0}
{"headline": "Tom Petty's Family Demands Trump Stop Using 'I Won't Back Down' In 'Campaign Of Hate'", "is_sarcastic": 0}
{"headline": "TikTok Users, K-Pop Fans Say They Sabotaged Trump Rally By Inflating Registrations", "is_sarcastic": 0}
{"headline": "Police: Cellphone Pings Helped Locate Missing Idaho Children's Remains", "is_sarcastic": 0}
{"headline": "Prince Harry Supports Decision To Review Singing Of Slave Song At Rugby Games", "is_sarcastic": 0}
{"headline": "Non-White Jail Officers Claim They Weren't Allowed To Monitor Derek Chauvin", "is_sarcastic": 0}
{"headline": "Tennessee Newspaper Blasted For Printing Ad Claiming 'Islam' Is Going To Nuke Nashville", "is_sarcastic": 0}
{"headline": "Homeland Security Secretary: Trump's Threats To 'Bomb' Bolton Were A Joke", "is_sarcastic": 0}
{"headline": "House Judiciary Chairman: Calls For Barr's Impeachment Are 'Waste Of Time'", "is_sarcastic": 0}
{"headline": "Zoomers Boast They Sabotaged Trump Rally Turnout With Fake Reservations", "is_sarcastic": 0}
{"headline": "Millions Are Unemployed. Crises Abound. Is It Time To Guarantee Public Service Jobs?", "is_sarcastic": 0}
{"headline": "Investing In Harm Reduction Must Be Included In The Movement To Defund Police", "is_sarcastic": 0}
{"headline": "UK Stabbing Attack Declared A Terrorist Incident, Police Say", "is_sarcastic": 0}
{"headline": "Minneapolis Shooting Leaves 1 Dead, 11 Injured", "is_sarcastic": 0}
{"headline": "Trump Uses Racist Terms 'Kung Flu' And 'Chinese Virus' To Describe COVID-19", "is_sarcastic": 0}
{"headline": "Trump Camp Lashes Media, 'Radical Protesters' For Lackluster Rally Turnout", "is_sarcastic": 0}
{"headline": "After Weeks Of Anticipation, Trump Rally Crowd Underwhelms", "is_sarcastic": 0}
{"headline": "Twin Trump 'Bunker Baby' Balloons Make The Scene Ahead Of Tulsa Rally", "is_sarcastic": 0}
{"headline": "North Face Becomes Biggest Brand To Pull Ads From Facebook In #StopHateforProfit Movement", "is_sarcastic": 0}
{"headline": "Trump Fires U.S. Attorney Who Led Probes Of The President's Men", "is_sarcastic": 0}
{"headline": "6 Staffers Working On Trump's Tulsa Rally Test Positive For COVID-19", "is_sarcastic": 0}
{"headline": "Community Wants Answers After LA Deputies Fatally Shoot Teen Who Ran From Them", "is_sarcastic": 0}
{"headline": "Police Arrest Peaceful Protester Sitting Alone By Trump Rally Venue", "is_sarcastic": 0}
{"headline": "Joe Biden Raised More Money Than Donald Trump For The First Time", "is_sarcastic": 0}
{"headline": "Eskimo Pie Drops 'Derogatory' Name After Nearly A Century", "is_sarcastic": 0}
{"headline": "Judge Rejects White House Request To Block John Bolton's New Book", "is_sarcastic": 0}
{"headline": "Florida Governor Ripped For Trying To Pin COVID-19 Spike On Hispanic Workers", "is_sarcastic": 0}
{"headline": "3 Congressional Races To Watch In New York's Democratic Primary", "is_sarcastic": 0}
{"headline": "The Coronavirus Pandemic Doesn't Care That We're All Bored With It", "is_sarcastic": 0}
{"headline": "Mick Mulvaney Spectacularly Self-Owns With His 'One Criticism' Of Donald Trump", "is_sarcastic": 0}
{"headline": "Tulsa Health Official Has A Stark Wake-Up Call For People Attending Trump Rally", "is_sarcastic": 0}
{"headline": "What Reforming Police Unions Might Look Like", "is_sarcastic": 0}
{"headline": "Robert E. Lee Statue Sleeps With The Fishes In Jim Carrey’s New Cartoon", "is_sarcastic": 0}
{"headline": "Fox News' John Roberts Uses War Analogy To Describe Preparing For Trump Rally In Pandemic", "is_sarcastic": 0}
{"headline": "Susan Rice Explains Exactly Why Trump's White House Is 'Racist To Its Core'", "is_sarcastic": 0}
{"headline": "Scathing Supercut Shows How Quickly Trump Flips On His Once Most Trusted Aides", "is_sarcastic": 0}
{"headline": "Trump's 'Racist' Toddler Video Removed By Facebook,Twitter After Parent Complains", "is_sarcastic": 0}
{"headline": "50 Years After MLK, Pastors Lead A New Poor People's March", "is_sarcastic": 0}
{"headline": "William Barr Says U.S. Attorney In Manhattan Is Resigning. U.S. Attorney Says No, He's Not.", "is_sarcastic": 0}
{"headline": "US Attorney Who Oversaw Cases Of Trump Allies Steps Down", "is_sarcastic": 0}
{"headline": "Trump Compared To Segregationist George Wallace In Scathing Republican Ad", "is_sarcastic": 0}
{"headline": "Pressed Repeatedly To Say ‘Black Lives Matter,’ Mike Pence Says ‘All Lives Matter’", "is_sarcastic": 0}
{"headline": "Anthony Fauci Warned White House That Tulsa Rally Would Be Dangerous: Report", "is_sarcastic": 0}
{"headline": "Twitter Users Give Trump's Tulsa Rally Another Name: 'Coronapalooza'", "is_sarcastic": 0}
{"headline": "GOP Candidate Says Black Democratic Opponent Is 'NOT For ALL Virginians'", "is_sarcastic": 0}
{"headline": "Little Sign Of COVID Spike After Nationwide Protests, But Officials Remain Cautious", "is_sarcastic": 0}
{"headline": "Trump Sets The Stage For Mayhem At Tulsa Rally", "is_sarcastic": 0}
{"headline": "Thomas Jefferson Descendant Calls For Removal Of His Famous Ancestor's Statues", "is_sarcastic": 0}
{"headline": "Juneteenth Will Be An Official Holiday In New York City Starting In 2021", "is_sarcastic": 0}
{"headline": "The Real Looters Of The Bronx", "is_sarcastic": 0}
{"headline": "Judge Doubts White House Can Keep Bolton Book Away From Public", "is_sarcastic": 0}
{"headline": "Coloradans Are Getting Mysterious Texts Bashing Democratic Senate Candidate John Hickenlooper", "is_sarcastic": 0}
{"headline": "Court Says Trump Rally Attendees Don't Have To Wear Masks", "is_sarcastic": 0}
{"headline": "Melania Trump Posts Juneteenth Tweet And Gets Reminded Of 'Birther' Past", "is_sarcastic": 0}
{"headline": "Navy Upholds Firing Of Carrier Captain In Virus Outbreak", "is_sarcastic": 0}
{"headline": "Juneteenth Brings Anti-Racism Protesters Out From Coast To Coast", "is_sarcastic": 0}
{"headline": "TSA Worsened Coronavirus Pandemic, Whistleblower Says", "is_sarcastic": 0}
{"headline": "More Lawmakers, Including Republicans, Support A Juneteenth National Holiday", "is_sarcastic": 0}
{"headline": "Donald Trump Vows To Keep Trying To End Dreamer Protections", "is_sarcastic": 0}
{"headline": "Louisville Officer Is Being Fired 3 Months After Fatally Shooting Breonna Taylor", "is_sarcastic": 0}
{"headline": "Most Americans Want Juneteenth To Become A National Holiday", "is_sarcastic": 0}
{"headline": "Trump Threatens Protesters On Juneteenth", "is_sarcastic": 0}
{"headline": "Exclusive: UK Charities And Schools Blasted For Hosting Mock 'Slave Auctions'", "is_sarcastic": 0}
{"headline": "Street Art Takes A Stand Against Racism In Solidarity With Black Lives Matter", "is_sarcastic": 0}
{"headline": "The Worst Of The Coronavirus Pandemic Is Still To Come", "is_sarcastic": 0}
{"headline": "Malala Graduates From Oxford 8 Years After Surviving Taliban Gunmen", "is_sarcastic": 0}
{"headline": "Arnold Schwarzenegger Goes Full Terminator On People Politicizing Face Masks", "is_sarcastic": 0}
{"headline": "Charles Booker Suddenly Has Progressives Excited About Kentucky", "is_sarcastic": 0}
{"headline": "Conservative Columnist Underscores The Magnitude Of What Bolton’s Book Reveals", "is_sarcastic": 0}
{"headline": "Trump Insists He's Healthy, Says West Point Ramp 'Was Like An Ice Skating Rink'", "is_sarcastic": 0}
{"headline": "Twitter Users Take Eric Trump To The Woodshed For Lame Swipe At Biden", "is_sarcastic": 0}
{"headline": "Tennessee Lawmakers Advance 6-Week Abortion Ban In Overnight Vote", "is_sarcastic": 0}
{"headline": "'Into the Wild' Bus Removed From Alaska Backcountry", "is_sarcastic": 0}
{"headline": "Twitter Adds 'Manipulated Media' Tag To Trump Tweet About 'Racist Baby'", "is_sarcastic": 0}
{"headline": "Oklahoma Republicans Speak Out Against Trump Ahead Of Tulsa Rally", "is_sarcastic": 0}
{"headline": "Fauci Warns Of Troubling ‘Anti-Science’ Beliefs As Nation Battles Coronavirus", "is_sarcastic": 0}
{"headline": "Klobuchar Withdraws From VP Search, Says Biden Should Select Woman of Color", "is_sarcastic": 0}
{"headline": "Republicans Running Anti-China Campaigns Shrug Off Trump Seeking China Reelection Help", "is_sarcastic": 0}
{"headline": "Senior State Department Official Resigns Over Trump’s Response To Racial Injustice", "is_sarcastic": 0}
{"headline": "Americans Are Losing Faith In What The Government Says About Coronavirus", "is_sarcastic": 0}
{"headline": "Interior Dept. Consulted ‘Junk Science’ Troll On ‘Transparency’ Rule, Emails Show", "is_sarcastic": 0}
{"headline": "The Supreme Court’s Landmark LGBTQ Rights Decision Didn't Address One Crucial Thing", "is_sarcastic": 0}
{"headline": "CBS Reporter Paula Reid Asks Trump Question All Journalists Should Ask", "is_sarcastic": 0}
{"headline": "‘We’re Here To Stay’: Dreamers Celebrate DACA Ruling", "is_sarcastic": 0}
{"headline": "Effigy Found Near California Park Where Nooses Were Recently Removed", "is_sarcastic": 0}
{"headline": "Florida Sees Record Number Of Coronavirus Cases As Experts Eye Possible New Epicenter", "is_sarcastic": 0}
{"headline": "California Issues New, Stricter Statewide Mask Requirement", "is_sarcastic": 0}
{"headline": "Facebook Takes Down Trump Campaign Ads Featuring Nazi Iconography", "is_sarcastic": 0}
{"headline": "Genetically Modified 'Friendly' Mosquitoes Approved For Insect Population Control In the U.S.", "is_sarcastic": 0}
{"headline": "Senate Confirms Mitch McConnell's 38-Year-Old Protege To Powerful Court Seat", "is_sarcastic": 0}
{"headline": "Republicans Dismiss Bombshell John Bolton Allegations Against Trump", "is_sarcastic": 0}
{"headline": "Lin-Manuel Miranda Burns John Bolton For Using 'Hamilton' Song As Book Title", "is_sarcastic": 0}
{"headline": "Trump Begging Xi For Election Help May Crimp His Efforts To Paint Biden As Soft On China", "is_sarcastic": 0}
{"headline": "The Trump Administration Has Left Workplace Safety Up To Your Boss", "is_sarcastic": 0}
{"headline": "Millions Of Hydroxychloroquine Pills That Trump Touted For COVID-19 Are Now In Limbo", "is_sarcastic": 0}
{"headline": "Video Shows 6 American Oil Executives Jailed In Venezuela", "is_sarcastic": 0}
{"headline": "Democrats Call For Permanent Protection Of Dreamers After Supreme Court’s DACA Ruling", "is_sarcastic": 0}
{"headline": "Trump Takes Credit For 'Making Juneteenth Famous' In Dumbfounding Interview", "is_sarcastic": 0}
{"headline": "Former U.S. Ambassador Jean Kennedy Smith Dies At 92", "is_sarcastic": 0}
{"headline": "Twitter Users Pile On Trump After He Asks If Supreme Court Dislikes Him", "is_sarcastic": 0}
{"headline": "Obama Praises Supreme Court DACA Ruling, Says Biden Would Protect Dreamers", "is_sarcastic": 0}
{"headline": "Nancy Pelosi Removes Portraits Of Confederate House Speakers From U.S. Capitol", "is_sarcastic": 0}
{"headline": "Federal Prison Riot Team That Patrolled D.C. Streets Injured Colleagues In Training Exercises", "is_sarcastic": 0}
{"headline": "Trump Rips Supreme Court Ruling That Saves DACA: 'Shotgun Blasts Into The Face'", "is_sarcastic": 0}
{"headline": "GOP Sheriff Who Refused To Enforce Coronavirus Lockdown Tests Positive At White House", "is_sarcastic": 0}
{"headline": "Supreme Court Rules Trump Wrongly Ended DACA, Leaves Program In Place", "is_sarcastic": 0}
{"headline": "The Tentative Return of Summer Fun Has Begun In Europe", "is_sarcastic": 0}
{"headline": "Why Biden Is Trouncing Trump With Young Voters: ‘Old Is Way, Way Better Than Liar’", "is_sarcastic": 0}
{"headline": "Atlanta Police Officers Call Out Of Work After Officers Charged In Rayshard Brooks Case", "is_sarcastic": 0}
{"headline": "1.5 Million More Americans Sought Unemployment Claims Last Week", "is_sarcastic": 0}
{"headline": "John Bolton: Trump Not Fit For Office, Putin Thinks He Can 'Play Him Like A Fiddle'", "is_sarcastic": 0}
{"headline": "Jennifer McClellan Could Make History As Virginia's First Black Female Governor", "is_sarcastic": 0}
{"headline": "Tucker Carlson’s Racist Rhetoric Laid Bare With The Help Of Some... Rabbits", "is_sarcastic": 0}
{"headline": "GOP Senator Tells Trump Fans At High Risk For Coronavirus To Skip Rally", "is_sarcastic": 0}
{"headline": "Trump's Midnight Twitter Rant Against Bolton Backfires Spectacularly", "is_sarcastic": 0}
{"headline": "'Disturbing’ Ivanka Trump Emails Resurface In Wake Of Bolton Book", "is_sarcastic": 0}
{"headline": "WaPost Board: Pence Destroys Own Credibility By Ignoring Coronavirus Reality", "is_sarcastic": 0}
{"headline": "Honduras President Hospitalized With COVID-19 And Pneumonia", "is_sarcastic": 0}
{"headline": "Chris Hayes Goes To Town On ‘Morally Odious’ Bolton: Trying To 'Cash In On Betrayal'", "is_sarcastic": 0}
{"headline": "Rep. Cedric Richmond Calls Out Matt Gaetz In Fiery Exchange: 'Was That A Nerve?'", "is_sarcastic": 0}
{"headline": "Trump Says Police Killing Of Rayshard Brooks ‘Terrible,’ But ‘You Can’t Resist’ Officers", "is_sarcastic": 0}
{"headline": "Trump Excoriates John Bolton Ahead Of Book Release: 'He Is A Liar'", "is_sarcastic": 0}
{"headline": "Justice Department Seeks Restraining Order Against John Bolton Over New Book", "is_sarcastic": 0}
{"headline": "Welcome To The Mask Wars", "is_sarcastic": 0}
{"headline": "Israel Hawks Are Scrambling To Save Democratic Rep. Eliot Engel", "is_sarcastic": 0}
{"headline": "‘That 70s Show’ Actor Danny Masterson Charged With Raping 3 Women", "is_sarcastic": 0}
{"headline": "Bolton Claims Trump Encouraged Xi To Build 'Concentration Camps' For Uighurs", "is_sarcastic": 0}
{"headline": "Boy Scouts Of America Will Require Eagle Scouts To Earn New Diversity Badge", "is_sarcastic": 0}
{"headline": "California Police Investigating Nooses Found In Trees As A Hate Crime", "is_sarcastic": 0}
{"headline": "Former Atlanta Cop Charged With Murder In Death Of Rayshard Brooks", "is_sarcastic": 0}
{"headline": "White House Won't Say If Medical Professionals OK'd Trump Rally", "is_sarcastic": 0}
{"headline": "ACLU Drags John Bolton's Record After He Retweets Support Of His Book Release", "is_sarcastic": 0}
{"headline": "Tulsa Health Official Urges Rally Postponement As Oklahoma Sees Spike In COVID-19 Cases", "is_sarcastic": 0}
{"headline": "Bolton Claims Trump Asked China's President For Favor To Boost Reelection Chances", "is_sarcastic": 0}
{"headline": "Atlanta Megachurch Pastor Apologizes For 'Blessing Of Slavery' Comment", "is_sarcastic": 0}
{"headline": "Iowa Governor Will Restore Voting Rights To Felons", "is_sarcastic": 0}
{"headline": "5 Years After Charleston Church Shooting, South Carolina Protects Racist Monuments", "is_sarcastic": 0}
{"headline": "Assault Charges For Missouri Detective Accused Of Hitting Protester With SUV", "is_sarcastic": 0}
{"headline": "Senate Passes Major Public Lands Bill", "is_sarcastic": 0}
{"headline": "Democrats Knock GOP Police Reform Bill, Call For 'Improvement'", "is_sarcastic": 0}
{"headline": "COVID-19 And Protests: Views from HuffPost Readers", "is_sarcastic": 0}
{"headline": "Don Winslow Exposes The Art Of Trump’s Fake Victory Lap", "is_sarcastic": 0}
{"headline": "Carol Barr, Wife Of GOP Rep. Andy Barr, Dies Suddenly At Age 39", "is_sarcastic": 0}
{"headline": "The Police Aren't Very Good At Their Main Job: Solving Crimes", "is_sarcastic": 0}
{"headline": "Why The World Is More Worried Than Ever About A 2nd Wave", "is_sarcastic": 0}
{"headline": "Uncle Ben’s ‘Evolving’ Its Brand Identity After Aunt Jemima Name Change", "is_sarcastic": 0}
{"headline": "Mississippi Official: Black People 'Dependent' Since Slavery", "is_sarcastic": 0}
{"headline": "Aunt Jemima To Change Name After Acknowledging 'Racial Stereotype'", "is_sarcastic": 0}
{"headline": "GOP Cowardice On Trump Takes Center Stage In Scathing New Supercut", "is_sarcastic": 0}
{"headline": "Anthony Fauci Hasn’t Talked With Trump About Coronavirus In 2 Weeks", "is_sarcastic": 0}
{"headline": "Russia Sets Up 'Disinfection Tunnel' To Protect Putin From Virus, State Media Says", "is_sarcastic": 0}
{"headline": "Inside The Dangerous Online Fever Swamps Of American Police", "is_sarcastic": 0}
{"headline": "'As Pathetic As It Is Reckless': Mike Pence Hammered Over Coronavirus Op-Ed", "is_sarcastic": 0}
{"headline": "Trump Gets Hit With Blunt Fact-Check For AIDS Vaccine Falsehood", "is_sarcastic": 0}
{"headline": "Book By Trump’s Niece To Reveal He ‘Derided’ Father’s Alzheimer’s Struggles", "is_sarcastic": 0}
{"headline": "Honduran President Diagnosed With COVID-19", "is_sarcastic": 0}
{"headline": "Ingraham Shows She’s Either Oblivious To Trump's Racism — Or Is Gaslighting You", "is_sarcastic": 0}
{"headline": "White House Steps Up Effort To Downplay Coronavirus Concerns", "is_sarcastic": 0}
{"headline": "3 States See Record High In Daily Coronavirus Infections After Reopening", "is_sarcastic": 0}
{"headline": "Republican Group Questions Trump’s Health: ‘It’s Time We Talk About This’", "is_sarcastic": 0}
{"headline": "Judge Orders Trump Administration To Give Tribes Their COVID-19 Relief Funds", "is_sarcastic": 0}
{"headline": "New Mexico Shooting Raises Specter Of Right-Wing Violence Around Statue Protests", "is_sarcastic": 0}
{"headline": "Pence Says All 50 States Reopening In 'Responsible Manner.' Fauci Says Otherwise.", "is_sarcastic": 0}
{"headline": "House Leadership Announces Upcoming Vote On D.C. Statehood", "is_sarcastic": 0}
{"headline": "Mississippi Set To Become The 13th State To Criminalize Fossil Fuel Protests", "is_sarcastic": 0}
{"headline": "Far-Right 'Boogaloo' Supporter Charged With Murder In Deaths Of Officers", "is_sarcastic": 0}
{"headline": "Congress Headed Toward Standoff On Police Reform", "is_sarcastic": 0}
{"headline": "Trump Administration Sues To Block Release Of Bolton Book", "is_sarcastic": 0}
{"headline": "Ilhan Omar Isn't Done Fighting", "is_sarcastic": 0}
{"headline": "‘You Can Call Me A Snitch’: 911 Dispatcher Alerted Supervisor To George Floyd’s Arrest", "is_sarcastic": 0}
{"headline": "20 Troops Killed In Himalayas Clash With Chinese Army, Indian Officials Say", "is_sarcastic": 0}
{"headline": "Virginia Democrats Could Elect The First Black Physician To Congress", "is_sarcastic": 0}
{"headline": "'Woefully Inadequate': Trump Order Falls Short Of Broader Push To Curb Cop Abuse", "is_sarcastic": 0}
{"headline": "Nebraska Democrats Renounce Their Senate Pick Over Comments", "is_sarcastic": 0}
{"headline": "Virginia Governor To Propose Juneteenth As State Holiday", "is_sarcastic": 0}
{"headline": "PG&E Pleads Guilty To Involuntary Manslaughter Of 84 People In Deadly California Fire", "is_sarcastic": 0}
{"headline": "The Democratic Party Launches Its First 2020 Ad Campaign Targeting Trump", "is_sarcastic": 0}
{"headline": "Trump Claims COVID-19 Will Go Away And That An AIDS Vaccine Exists. It Doesn’t.", "is_sarcastic": 0}
{"headline": "Atlanta Police Officer Who Shot Rayshard Brooks Had Past Reprimand For Use Of Force", "is_sarcastic": 0}
{"headline": "Congress Could Make Juneteenth A National Holiday", "is_sarcastic": 0}
{"headline": "Trump Says He Gave Out 1 Million Tickets To His Tulsa Rally. That Means 980,801 Fans Won't Fit.", "is_sarcastic": 0}
{"headline": "NYPD Finds ‘No Criminality’ After Cop Union Alleged Shake Shack Poisoned Officers", "is_sarcastic": 0}
{"headline": "Coronavirus Cases Surge In Alabama, South Carolina And Oklahoma", "is_sarcastic": 0}
{"headline": "Americans Are The Unhappiest They've Been In 50 Years, Poll Finds", "is_sarcastic": 0}
{"headline": "The Coronavirus Is Still Spreading, Trump And Congress Are Still Dithering", "is_sarcastic": 0}
{"headline": "After George Floyd’s Death, Indigenous Communities Call Out ‘Broken System’", "is_sarcastic": 0}
{"headline": "Ex-Trump Aide Sebastian Gorka May Get Role Atop Voice Of America: Report", "is_sarcastic": 0}
{"headline": "3 Indian Soldiers Killed In ‘Violent Face-Off’ With Chinese Troops At Border", "is_sarcastic": 0}
{"headline": "African Nations Draft Resolution To Investigate U.S. For Human Rights Violations", "is_sarcastic": 0}
{"headline": "‘So True!’ Trump Mocked For Retweeting Himself, Then Agreeing With Himself", "is_sarcastic": 0}
{"headline": "Justice Department Sets New Dates To Begin Executing Federal Inmates On Death Row", "is_sarcastic": 0}
{"headline": "Anderson Cooper Debunks Trump's Latest Coronavirus Claim With Basic Child Psychology", "is_sarcastic": 0}
{"headline": "Dr. Sanjay Gupta: Trump Rally Is ‘Worst-Case Scenario’ For Spreading Coronavirus", "is_sarcastic": 0}
{"headline": "Laura Ingraham Calls Fauci ‘Medical Deep State,’ Tells Trump To Ignore Rally Virus Warnings", "is_sarcastic": 0}
{"headline": "North Korea Attacks Inter-Korean Liaison Office, South Korea Says", "is_sarcastic": 0}
{"headline": "Lara Trump Insists President Has No Health Issues Despite Awkward Ramp Walk", "is_sarcastic": 0}
{"headline": "Man Arrested In Shooting During Protest Of Spanish Conqueror Statue In Albuquerque", "is_sarcastic": 0}
{"headline": "Pence Tells Governors To Share Misleading Facts About Coronavirus Infections: Reports", "is_sarcastic": 0}
{"headline": "Tucker Carlson Dials Up Fear Factor In Ugly New Attack On Black Lives Matter", "is_sarcastic": 0}
{"headline": "Rep. Ilhan Omar’s Father Dies From Complications Of COVID-19", "is_sarcastic": 0}
{"headline": "Fox News Presses Larry Kudlow On COVID-19 Spikes After He Declared No Second Wave", "is_sarcastic": 0}
{"headline": "NYPD To Reassign 600 ‘Anti-Crime’ Plainclothes Officers Amid Protests", "is_sarcastic": 0}
{"headline": "Trump Rally Not Welcome Here, Snaps Tulsa Newspaper Editorial", "is_sarcastic": 0}
{"headline": "Oklahoma Governor Invites Donald Trump To Visit Site Of Tulsa Race Massacre", "is_sarcastic": 0}
{"headline": "Pence Says Oklahoma COVID-19 Cases Have 'Flattened' — 2 Days After Record Jump", "is_sarcastic": 0}
{"headline": "D.C. Statehood Gains New Support Among Senate Democrats After Trump Occupation", "is_sarcastic": 0}
{"headline": "Charles Booker Hits Amy McGrath For Skipping Anti-Racism Protests In New Kentucky Senate Ad", "is_sarcastic": 0}
{"headline": "Missing Black Lives Matter Activist Among 2 Women Found Dead: Police", "is_sarcastic": 0}
{"headline": "Trump Suggests Stopping COVID-19 Tests Would Result In Fewer Cases", "is_sarcastic": 0}
{"headline": "Joe Biden And The DNC Raised $80 Million In May", "is_sarcastic": 0}
{"headline": "Democrats Say Law Protecting LGBTQ Rights Still Needed Even After SCOTUS Victory", "is_sarcastic": 0}
{"headline": "Protests Spark Renewed Outcry Over Black Teen’s 55-Year 'Accomplice' Prison Sentence", "is_sarcastic": 0}
{"headline": "John Cleese Mocks Fox News For Confusing Monty Python With CHAZ Protesters", "is_sarcastic": 0}
{"headline": "It’s ‘Clear’ Firing Someone For Being Gay Is Wrong, Gorsuch Says In Title VII Opinion", "is_sarcastic": 0}
{"headline": "Politicians Praise Supreme Court’s Decision On LGBTQ Worker Protections", "is_sarcastic": 0}
{"headline": "'A Shocking Dereliction Of Duty': Supreme Court Brushes Off Police Immunity Cases", "is_sarcastic": 0}
{"headline": "Partisan Fault Lines Emerge In Congress Over Police Reform", "is_sarcastic": 0}
{"headline": "Supreme Court Rules For Pipeline In Appalachian Trail Dispute", "is_sarcastic": 0}
{"headline": "Supreme Court Says LGBTQ Employees Are Protected By Civil Rights Employment Statutes", "is_sarcastic": 0}
{"headline": "Supreme Court Declines To Hear Trump's Legal Challenge To 'Sanctuary' Laws", "is_sarcastic": 0}
{"headline": "White Woman Calls Cops On Man Writing 'Black Lives Matter' On His Own Property", "is_sarcastic": 0}
{"headline": "Voice Of America Denounces CDC For Blacklisting Reporters After White House Smear", "is_sarcastic": 0}
{"headline": "Journalist Maria Ressa, Critic Of Rodrigo Duterte, Convicted Of Libel", "is_sarcastic": 0}
{"headline": "China's New Virus Outbreak Underscores Continued Threat", "is_sarcastic": 0}
{"headline": "American Paul Whelan Sentenced To 16 Years In Russia On Spying Charges", "is_sarcastic": 0}
{"headline": "Trump’s Niece To Publish Tell-All Including ‘Salacious’ Details About President: Report", "is_sarcastic": 0}
{"headline": "Chilling New Footage Shows Police Officer Ignoring Pleas To Help George Floyd", "is_sarcastic": 0}
{"headline": "Overwhelmed By COVID-19, India To Transform Train Cars Into Makeshift Hospital Wards", "is_sarcastic": 0}
{"headline": "Trump Tweet Mocking Obama’s ‘Unpresidential’ Walk Resurfaces After Ramp Incident", "is_sarcastic": 0}
{"headline": "Police Video Shows Rayshard Brooks Sobriety Test Quickly Turning Deadly", "is_sarcastic": 0}
{"headline": "Cuomo Warns He May Reverse Reopenings After New York Gets 25,000 Complaints", "is_sarcastic": 0}
{"headline": "Larry Kudlow Vows End To $600 Unemployment Aid As 'Disincentive' To Work", "is_sarcastic": 0}
{"headline": "Ben Carson Tells U.S. To 'Grow Up' Over Racist Gripes; Stacey Abrams Calls Him 'Infantile'", "is_sarcastic": 0}
{"headline": "White House Adviser: No 'Transparency' Promise Ever Made Over Billions In Loans", "is_sarcastic": 0}
{"headline": "Protests Continue In U.S. After Deaths Of More Black Men", "is_sarcastic": 0}
{"headline": "Republican Senator 'Absolutely' Supports National Ban On Police Chokeholds", "is_sarcastic": 0}
{"headline": "Ex-Defense Secretary: ‘Time Has Come’ To Strip Military Bases Of Confederate Names", "is_sarcastic": 0}
{"headline": "Blind Voters Fear Loss Of Privacy With Shift To Mail Voting", "is_sarcastic": 0}
{"headline": "Lebanon Protesters Call On Government To Resign Amid Crisis", "is_sarcastic": 0}
{"headline": "Joe Biden Has Problems He Can’t Solve From His Basement", "is_sarcastic": 0}
{"headline": "Health Expert Calls Trump's Tulsa Rally 'Extraordinarily Dangerous Move’", "is_sarcastic": 0}
{"headline": "Fox News is Lying About Seattle’s ‘Autonomous Zone’", "is_sarcastic": 0}
{"headline": "Trump Tries To Explain Awkward West Point Walk That Lit Up Twitter Critics", "is_sarcastic": 0}
{"headline": "Florida Hits Biggest Daily COVID-19 Jump As It Gears Up For GOP Convention", "is_sarcastic": 0}
{"headline": "Protesters Light Fire Inside Wendy's Where Atlanta Police Killed Black Man", "is_sarcastic": 0}
{"headline": "Secret Service Finally Admits It Used Pepper Spray On Protesters Before Trump Church Pic", "is_sarcastic": 0}
{"headline": "Far-Right Protesters Clash With Anti-Racist Demonstrators In London", "is_sarcastic": 0}
{"headline": "Seattle Man Gets $1.1 Million Coronavirus Hospital Bill: Report", "is_sarcastic": 0}
{"headline": "U.S. Embassy in Seoul, South Korea, Unfurls Giant Black Lives Matter Banner", "is_sarcastic": 0}
{"headline": "Melania Trump Used Delay In White House Move To Renegotiate Prenup: Book", "is_sarcastic": 0}
{"headline": "TikTok Comedian Sarah Cooper Spills Secrets On Lip-Synching Trump In Jimmy Fallon Interview", "is_sarcastic": 0}
{"headline": "Atlanta Police Chief Resigns After Cop Kills Black Man At A Wendy's (UPDATE)", "is_sarcastic": 0}
{"headline": "‘To Say That She’s An Abusive Figure Is An Understatement’: At ABC News, Toxicity Thrives", "is_sarcastic": 0}
{"headline": "Tulsa Health Officials Urge Caution On Gatherings Just 1 Week Before Trump Rally", "is_sarcastic": 0}
{"headline": "Trump Administration Says It's Not Forcing People Back To Work. Workers Disagree.", "is_sarcastic": 0}
{"headline": "Trump 'Exploited Sacred Symbols,' Says Church Where He Married Melania", "is_sarcastic": 0}
{"headline": "'A Setup For Disaster': Doctors Issue Ominous Coronavirus Warnings About Trump Rally", "is_sarcastic": 0}
{"headline": "Trump Is ‘Too Small To Meet The Moment’ In New Biden Attack Ad", "is_sarcastic": 0}
{"headline": "Don Lemon Responds To Dave Chappelle's Criticism Of Him In New Netflix Special", "is_sarcastic": 0}
{"headline": "Lindsey Graham In New Ad: 'Joe Biden Is As Good A Man As God Ever Created'", "is_sarcastic": 0}
{"headline": "Udder Failure: Devin Nunes Can't ID Critics Behind Cow Tweets, So Suit Appears Moot", "is_sarcastic": 0}
{"headline": "Trump Moves Tulsa Rally So It Won't Fall On Juneteenth", "is_sarcastic": 0}
{"headline": "Anti-Racism Protests Held Coast To Coast Across U.S.", "is_sarcastic": 0}
{"headline": "Accused California Cop Killer Linked To Right-Wing Extremist Boogaloo Movement", "is_sarcastic": 0}
{"headline": "DOJ Spreads Bogus Claim About Maryland Protest In Letter Defending Religious Liberty", "is_sarcastic": 0}
{"headline": "The Real Violent Extremist Threat Growing During Protests", "is_sarcastic": 0}
{"headline": "Trump Reverses Rule Protecting Transgender Patients From Discrimination", "is_sarcastic": 0}
{"headline": "Naming Bases For Confederate Generals Is Like Having A Camp Bin Laden, Charges Vets' Ad", "is_sarcastic": 0}
{"headline": "12 Amazing Photos You Missed This Week", "is_sarcastic": 0}
{"headline": "California Woman Goes On Racist Rant Against Woman Exercising In Park", "is_sarcastic": 0}
{"headline": "Fauci Urges Trump Rally Attendees To Wear Masks, Says Large Events Remain ‘Risky’", "is_sarcastic": 0}
{"headline": "GOP Congressman At Risk Of Losing Seat After Officiating Gay Wedding", "is_sarcastic": 0}
{"headline": "List For Biden’s VP Pick Narrows Down To Warren, Harris, Susan Rice And More", "is_sarcastic": 0}
{"headline": "Trump On Police Chokeholds: 'Concept' Is 'Innocent, So Perfect,' But Should Be Ended", "is_sarcastic": 0}
{"headline": "GOP Senator Touts Low Black Unemployment As Black Unemployment Hits 10-Year Peak", "is_sarcastic": 0}
{"headline": "John Bolton Says Reelection Is 'Only Thing That Mattered' To Trump", "is_sarcastic": 0}
{"headline": "As Greens Reckon With Racism, Staff At A Major Group Challenge Pro-Trump Board Member", "is_sarcastic": 0}
{"headline": "Band-Aid Announces New Bandages That 'Embrace The Beauty Of Diverse Skin'", "is_sarcastic": 0}
{"headline": "COVID-19 Live Updates: Young Chicago Patient Receives Lung Transplant", "is_sarcastic": 0}
{"headline": "Joe Scarborough Rips Trump With Painfully Honest Rewrite Of Rally Coronavirus Waiver", "is_sarcastic": 0}
{"headline": "Trump Is Back To Business As Usual As Virus Surges In States", "is_sarcastic": 0}
{"headline": "Twitter Axes 32,000 State-Linked Propaganda Accounts From Russia, China And Turkey", "is_sarcastic": 0}
{"headline": "Florida Migrant Towns Become Coronavirus Hot Spots In U.S.", "is_sarcastic": 0}
{"headline": "Cops Caught On Camera Napping, Relaxing In Lawmaker’s Office During Protests", "is_sarcastic": 0}
{"headline": "Keith Ellison, Once An Activist, Meets His Moment As Minnesota’s Top Prosecutor", "is_sarcastic": 0}
{"headline": "'Implicit Bias' Trainings Don't Actually Change Police Behavior", "is_sarcastic": 0}
{"headline": "Most Americans Want Police Reform But Don't Back 'Defund The Police'", "is_sarcastic": 0}
{"headline": "Joe Biden Calls On Facebook To Change Political Speech Rules", "is_sarcastic": 0}
{"headline": "Tom Cotton Accidentally Gives The Washington Monument An Awesome New Name", "is_sarcastic": 0}
{"headline": "Stacey Abrams Schools Meghan McCain On Authoritarian Trump, Georgia Voting Mess", "is_sarcastic": 0}
{"headline": "Supercut Exposes The Ugly Truth Of Trump’s Rhetoric On Protests", "is_sarcastic": 0}
{"headline": "Don Lemon: Trump Just Said ‘The Dumbest Thing I’ve Ever Heard’", "is_sarcastic": 0}
{"headline": "Biden Comes This Close To Dropping An F-Bomb On Trump's 'Very Fine' Racists", "is_sarcastic": 0}
{"headline": "‘The Daily Show’ PSA Begs Canada To Invade ‘Failed State’ America", "is_sarcastic": 0}
{"headline": "North Korea Vows To Build Up Military, Blasting 'Empty Promises' Made By Trump", "is_sarcastic": 0}
{"headline": "Joe Biden Mocked In Trump Campaign Ad For Kneeling — In A Church", "is_sarcastic": 0}
{"headline": "Trump Defends Racist Phrase By Citing Philadelphia's Infamous ‘Vote White’ Mayor", "is_sarcastic": 0}
{"headline": "Louisville City Council Bans No-Knock Warrants After Breonna Taylor’s Death", "is_sarcastic": 0}
{"headline": "Facebook Page Posting Trump's Verbatim Tweets Receives Erratic Response", "is_sarcastic": 0}
{"headline": "Republicans Move Convention Events, Trump Nomination Acceptance To Jacksonville, Florida", "is_sarcastic": 0}
{"headline": "Trump Praises His 'S.S.' For Protest Crackdown; Critics Go World War II", "is_sarcastic": 0}
{"headline": "Trump Campaign Says You Can't Sue If You Get COVID-19 At His Rally", "is_sarcastic": 0}
{"headline": "Young COVID-19 Patient Becomes First In U.S. To Receive Double Lung Transplant", "is_sarcastic": 0}
{"headline": "Evangelical Leader Calls On Denomination To Retire Gavel Named For Slaveholder", "is_sarcastic": 0}
{"headline": "Black Tulsans Call Trump's Juneteenth Rally Plan 'A Slap In The Face'", "is_sarcastic": 0}
{"headline": "Donald Trump’s Race Speech In Tulsa Will Be Just Another Sop To His White Supporters", "is_sarcastic": 0}
{"headline": "Amid Racial Justice Marches, GOP Advances Trump Court Pick Hostile To Civil Rights", "is_sarcastic": 0}
{"headline": "The Black Lives Matter Protests Are Working. Here’s Proof.", "is_sarcastic": 0}
{"headline": "With DACA In Peril, Black Dreamers Are Hoping For Equality And The Ability To Stay", "is_sarcastic": 0}
{"headline": "Tennessee Lawmakers Vote To Keep KKK Leader’s Bust In Capitol, Igniting Protests", "is_sarcastic": 0}
{"headline": "Trump Administration Refuses To Disclose Which Businesses Received $500 Billion In Government Bailout", "is_sarcastic": 0}
{"headline": "White Nationalist Richard Spencer Can't Afford To Pay Legal Fees In 'Unite The Right' Case", "is_sarcastic": 0}
{"headline": "In An Election Year, 2 Vulnerable GOP Senators Are Suddenly Conservationists", "is_sarcastic": 0}
{"headline": "NYPD Cop Who Kneeled At Protest Apologizes To Fellow Officers", "is_sarcastic": 0}
{"headline": "Trump Sanctions War Crimes Court To Silence Investigations Into U.S. Misconduct", "is_sarcastic": 0}
{"headline": "Missouri Newspaper Publisher Resigns After Printing Racist Cartoon", "is_sarcastic": 0}
{"headline": "Former DEA Spokesman Admits To Posing As 'Deep-Cover' CIA Agent In Fraud Scheme", "is_sarcastic": 0}
{"headline": "Donald Trump Makes Case For Joe Biden In Crazed All-Caps Tweet", "is_sarcastic": 0}
{"headline": "EPA Said Giving Polluters A Pass Protected Its Workers. Its Own Union Says That’s Gaslighting.", "is_sarcastic": 0}
{"headline": "Lockdown A Week Earlier Would Have Halved UK Coronavirus Death Toll, Says Neil Ferguson", "is_sarcastic": 0}
{"headline": "Nearly 300 Doctors In Delhi’s Municipal Hospitals Threaten Mass Resignations", "is_sarcastic": 0}
{"headline": "Trump Administration Proposes Sweeping Asylum Restrictions", "is_sarcastic": 0}
{"headline": "Top U.S. Military Official Calls His Appearance In Trump's Church Photo-Op 'A Mistake'", "is_sarcastic": 0}
{"headline": "Breonna Taylor Was Killed By Police. Their Report Lists Her Injuries As 'None.'", "is_sarcastic": 0}
{"headline": "Black Man Told Oklahoma Police 'I Can't Breathe' Before He Died, Video Shows", "is_sarcastic": 0}
{"headline": "Banksy Suggests What To Do With Toppled Statue Of Slave Trader", "is_sarcastic": 0}
{"headline": "1.5 Million More Americans Seek Unemployment Benefits", "is_sarcastic": 0}
{"headline": "U.S. Passes 2 Million Coronavirus Cases", "is_sarcastic": 0}
{"headline": "GOP State Senator Asks If Black People Get Coronavirus From Lax Handwashing", "is_sarcastic": 0}
{"headline": "Republican Group Says Trump Just Became The 'Confederacy's Second President'", "is_sarcastic": 0}
{"headline": "'Live PD' Dropped By A&E On Heels Of 'Cops' Cancellation", "is_sarcastic": 0}
{"headline": "Pulitzer-Winning Pandemic Reporter On Coronavirus: We're Far From Out Of The Woods", "is_sarcastic": 0}
{"headline": "Pols Tell Trump To Go Back To The Bunker After His Threat To ‘Take Back’ Seattle", "is_sarcastic": 0}
{"headline": "Don Lemon Exposes ‘White-Mansplaining’ Of Trump, White House Officials", "is_sarcastic": 0}
{"headline": "Anderson Cooper Blasts 'Lie Teller' Kayleigh McEnany For 'Orwellian' Trump Defense", "is_sarcastic": 0}
{"headline": "Statues Linked To Racist Past Toppled And Vandalized Around The U.S.", "is_sarcastic": 0}
{"headline": "LeBron James Is Fighting For Black Voting Rights With ‘More Than A Vote’ Initiative", "is_sarcastic": 0}
{"headline": "Trump Has Lost His Favorite Talking Point About Black Unemployment", "is_sarcastic": 0}
{"headline": "Jon Ossoff Wins Democratic Senate Nomination in Georgia", "is_sarcastic": 0}
{"headline": "Wisconsin Gym Under Fire For 'I Can't Breathe' Workout", "is_sarcastic": 0}
{"headline": "Amazon Announces One Year Pause On Police Use Of Its Facial Recognition Tech", "is_sarcastic": 0}
{"headline": "Trump White House Believes 'Defund The Police' Is A Political Gift", "is_sarcastic": 0}
{"headline": "With Trump's Approval Plunging, Republicans Say It's Too Early To Panic", "is_sarcastic": 0}
{"headline": "Disneyland Plans To Reopen July 17 Following Coronavirus Closure", "is_sarcastic": 0}
{"headline": "Nancy Pelosi Calls For Removing Confederate Statues From U.S. Capitol", "is_sarcastic": 0}
{"headline": "Public Opinion On Taking Down Confederate Monuments Hasn't Budged In The Last Three Years", "is_sarcastic": 0}
{"headline": "Donald Trump Is Acting Like The Coronavirus Is Gone. It Isn’t.", "is_sarcastic": 0}
{"headline": "Georgia's Primary Election Was A National Scandal", "is_sarcastic": 0}
{"headline": "NASCAR Bans Confederate Flag At Its Events And Properties", "is_sarcastic": 0}
{"headline": "Trump Won't 'Even Consider' Renaming Bases Named For Confederate Generals", "is_sarcastic": 0}
{"headline": "More Than 1,250 Ex-DOJ Workers Demand Probe Of AG Barr Over Protesters’ Removal", "is_sarcastic": 0}
{"headline": "White House Doubles Down On Trump’s Smear Against Protester Shoved By Police", "is_sarcastic": 0}
{"headline": "Anna Wintour Apologizes For Race-Related 'Mistakes' In Vogue Magazine", "is_sarcastic": 0}
{"headline": "Trump Campaign Demands CNN Apologize For Poll That Shows Him Losing To Biden", "is_sarcastic": 0}
{"headline": "Tear Gas Is Banned In Warfare But Not Against Protesters. A New Bill Could Change That.", "is_sarcastic": 0}
{"headline": "Cooking Rice In Sunlight: Migrant Workers Who Stayed Back Caught Between Hunger And Govt Apathy", "is_sarcastic": 0}
{"headline": "Revealed: Children Beg To Go Back To School After Being Locked Down In Abusive Homes", "is_sarcastic": 0}
{"headline": "Little Evidence Of Antifa Links In Protest Violence Prosecutions", "is_sarcastic": 0}
{"headline": "Ex-Judge Says Push To Dismiss Flynn Case Is 'Abuse Of Power'", "is_sarcastic": 0}
{"headline": "'I Am George Floyd': NFL Star Von Miller Writes Powerful Essay On Racism", "is_sarcastic": 0}
{"headline": "CrossFit CEO Steps Down After Stunningly Racist Commentary", "is_sarcastic": 0}
{"headline": "PM Defends Joining Huge Anti-Racism Protest Despite Urging Social Distancing", "is_sarcastic": 0}
{"headline": "Christopher Columbus Statue Beheaded In Boston Park", "is_sarcastic": 0}
{"headline": "As Many As 35 Million People Haven't Yet Received Stimulus Checks", "is_sarcastic": 0}
{"headline": "Minneapolis Police Dept. Withdrawing From Union Negotiations", "is_sarcastic": 0}
{"headline": "George Floyd's Brother To Congress: 'Stop The Pain'", "is_sarcastic": 0}
{"headline": "Boris Johnson Dumps Plan To Get All Primary Pupils In School Before Summer", "is_sarcastic": 0}
{"headline": "Teacher Ousts West Virginia State Senate Leader In GOP Primary", "is_sarcastic": 0}
{"headline": "Trump Administration Hints At Support For A Smaller Unemployment Boost", "is_sarcastic": 0}
{"headline": "Human Remains Found During Search For Missing Idaho Children", "is_sarcastic": 0}
{"headline": "N.J. Prison Guard Suspended For Mocking George Floyd's Death At Racism Protest", "is_sarcastic": 0}
{"headline": "Brazil Obeys Court Order To Resume Providing Full Virus Data", "is_sarcastic": 0}
{"headline": "Millions Of Taxpayer Dollars Are Going To Schools That Push Conversion Therapy", "is_sarcastic": 0}
{"headline": "West Virginia Elects Its First Out Transgender Official", "is_sarcastic": 0}
{"headline": "Tucker Carlson Rails Against Elmo And His Dad In Bonkers New Rant", "is_sarcastic": 0}
{"headline": "NASCAR’s Bubba Wallace Calls For Confederate Flags To Be Banned From Tracks", "is_sarcastic": 0}
{"headline": "Florida Police Group President Suspended Over 'Despicable' Facebook Posts", "is_sarcastic": 0}
{"headline": "Sean Hannity Claims Trump Is Also A Victim Of Crooked Cops: ‘It’s Horrific’", "is_sarcastic": 0}
{"headline": "World’s Largest Movie Theater Chain Plans To Reopen ‘Almost All’ U.S. Theaters In July", "is_sarcastic": 0}
{"headline": "New York Legislature Votes To Repeal Law Shielding Police Disciplinary Records", "is_sarcastic": 0}
{"headline": "'Cops' Canceled Amid Nationwide Reckoning Over Police Violence", "is_sarcastic": 0}
{"headline": "Mark Cuban: White People 'Get Defensive' When Discussing White Privilege", "is_sarcastic": 0}
{"headline": "Police Violence Videos Thwarting Officers Attempts To Control Narrative", "is_sarcastic": 0}
{"headline": "‘Worst Nightmare’ Coronavirus Pandemic Far From Over, Fauci Warns", "is_sarcastic": 0}
{"headline": "Many Police Aren’t Wearing Masks, Posing Yet Another Risk To Protesters In A Pandemic", "is_sarcastic": 0}
{"headline": "Sybrina Fulton, Trayvon Martin's Mother, Qualifies To Run For Public Office", "is_sarcastic": 0}
{"headline": "NY Police Union Boss Demands Respect For Officers After Brutal Protest Crackdowns", "is_sarcastic": 0}
{"headline": "With Trump MIA, Senate Republicans Go It Alone On Police Reform Efforts", "is_sarcastic": 0}
{"headline": "NHK Apologizes For Clip Attempting To Explain Black Lives Matter Protests To A Japanese Audience", "is_sarcastic": 0}
{"headline": "Yosemite National Park To Reopen This Week", "is_sarcastic": 0}
{"headline": "Protesting Racism: Views From HuffPost Readers", "is_sarcastic": 0}
{"headline": "Ocasio-Cortez, Sanders Endorse Progressive Charles Booker In Kentucky Senate Primary", "is_sarcastic": 0}
{"headline": "Sen. Susan Collins Loses Endorsement Of Major Gun Control Group", "is_sarcastic": 0}
